<template>
  <q-page padding>
  <div class="row q-mb-lg">
    <q-select
      v-model="book"
      float-label="Practice text"
     :options="books"
     class="col-md-3"
    />
    <q-spinner-circles  size="30px" v-show="loading"/>
  </div>
    Guide Script <q-btn-toggle
      class="col-lg-2 q-ma-md"
      v-model = "script"
      :dense="$q.platform.is.mobile"
      toggle-color="faded"
      label= "Guide Script"
      :options="[
        {label: 'Tamil', value: 'tamil'},
        {label: 'Tamil (Ext)', value: 'tamilext'},
        {label: 'Devanagari', value: 'devanagari'},
        {label: 'Roman', value: 'roman'}
      ]"
    /> <q-toggle v-model="hideguide" label="Implicit Guide" class="q-ml-lg" @input="showNotification"/><br/><br/>
      <QBtn color="grey-8" class="q-ma-md print-hide" @click="fontSize = fontSize + 3">
        <q-icon name="zoom in" />
      </QBtn>
      <QBtn color="grey-8" class="q-ma-md print-hide" @click="fontSize = fontSize - 3">
        <q-icon name="zoom out" />
      </QBtn>
  <small><div class="q-body-1 q-mt-md"><i> For large texts, this page may take a while to render. Please wait for the page to respond on selection. </i> </div></small>
  <div :style="'font-size:' + fontSize + 'px'" class="text q-mt-xl">
    <div v-for="(line, i) in textContent[book].split('\n')" :key="'line' + i">
    <span v-for="(word, i) in line.split(' ')" :key="'word' + i" class="q-ml-md">
    <span v-if="!hideguide">
      <span v-for="(syllable, i) in syllabize(word)" :key="'syllable' + i" class="q-ml-xs">
       <ruby class="sharada" :class="scripttype">{{convertDS(syllable)}}
       <rt class="noto guide" v-if="script === 'roman'">{{convertDR(syllable)}}</rt>
       <rt class="noto guide" v-if="script === 'devanagari'">{{syllable}}</rt>
       <rt class="guide tamil" v-if="script === 'tamil'">{{convertDTm(syllable)}}</rt>
       <rt class="guide tamilextended" v-if="script === 'tamilext'">{{Sanscript.t(syllable, 'devanagari', 'malayalam')}}</rt>

       </ruby>
      </span>
    </span>
    <span v-else>
      <span class="sharada q-ml-md">
        {{convertDS(word)}}
       <q-tooltip>
       <span class="noto" v-if="script === 'roman'">{{convertDR(word)}}</span>
       <span class="noto" v-if="script === 'devanagari'">{{word}}</span>
       <span class="tamil" v-if="script === 'tamil'">{{convertDTm(word)}}</span>
       <span class="tamilextended" v-if="script === 'tamilext'">{{Sanscript.t(word, 'devanagari', 'malayalam')}}</span>
      </q-tooltip>
      </span>
    </span>
    </span>
    </div>
  </div>
  </q-page>
</template>

<style scoped>
ruby {
  display: inline-flex;
  flex-direction: column-reverse;
}

rb, rt {
  display: inline;
  line-height: 2;
}

.text {
  line-height:3em;
}
.guide {
  color: grey;
}
</style>

<script>
import {QRadio, QBtn, QField, QBtnToggle, QToggle, QSlider, QRange, QSelect, QTooltip, QSpinnerCircles} from 'quasar'
import { ScriptMixin } from '../mixins/ScriptMixin'
var Sanscript = require('@sanskrit-coders/sanscript')
console.log(Sanscript)

export default {
  name: 'PageIndex',
  mixins: [ScriptMixin],
  components: {
    QRadio,
    QSpinnerCircles,
    QTooltip,
    QSelect,
    QBtn,
    QField,
    QBtnToggle,
    QToggle,
    QSlider,
    QRange
  },
  methods: {
    showNotification: function () {
      if (this.hideguide) {
        this.$q.notify({
          type: 'info',
          message: 'Hover or tap on a word for hints.',
          position: 'center',
          timeout: 2000
        })
      }
    },
    syllabize: function (word) {
      return word.split(/([कखगघङचछजझञटठडढणतथदधनऩपफबभमयरऱलळऴवशषसहच़छ़]([्][कखगघङचछजझञटठडढणतथदधनऩपफबभमयरऱलळऴवशषसहच़छ़])*[ऺऻािीुूृॄॅॆेैॊोौॖॗॢॣ्]?[ंःँ]?)|([।॥])|(\d+)|([०१२३४५६७८९॰]+)|(ॐ)|([अआइईउऊऋॠऌॡएऐओऔॳॴॶॷऎऒ][ंःँ]?)/).filter(x => x != null && x[0] !== '्' && x !== '')
    }
  },
  data () {
    return {
      fontSize: 27,
      loading: false,
      hideguide: false,
      script: 'tamil',
      scripttype: 'normal',
      book: 'adibuddha',
      Sanscript: Sanscript,
      books: [
        {label: 'Adibuddha Stotra', value: 'adibuddha'},
        {label: 'Shri Sukta', value: 'srisukta'},
        {label: 'Nilakantha Dharani', value: 'nilakantha'},
        {label: 'Prajnapramita Hridaya', value: 'heart'},
        {label: 'Pratityasamutpada', value: 'pratitya'},
        {label: 'Lalitavistara', value: 'lalitavistara'},
        {label: 'Buddhacharita', value: 'buddhacharita'},
        {label: 'Saddharma Pundarika', value: 'saddharma'},
        {label: 'Shalistambha', value: 'shalistamba'}
      ],
      textContent: {
        'buddhacharita': `बुद्धचरित

ऐक्ष्वाक इक्ष्वाकुसमप्रभावः
शाक्येष्वशक्येषु विशुद्धवृत्तः।
प्रियः शरच्चन्द्र इव प्रजानां
शुद्धोदनो नाम बभूव राजा॥१॥

तस्येन्द्रकल्पस्य बभूव पत्नी
दीप्त्या नरेन्द्रस्य समप्रभावा।
पद्मेव लक्ष्मीः पृथिवीव धीरा
मायेति नाम्नानुपमेव माया॥२॥

सार्ध तयासौ विजहार राजा
नाचिन्तयद्वैश्रवणस्य लक्ष्मीम्।
ततश्च विधेव समाधियुक्ता
गर्भ दधे पापविवर्जिता सा॥३॥

प्राग्गर्भधान्नान्मनुजेन्द्रपत्नी
सितं ददर्श द्विपराजमेकम्।
स्वप्ने विशन्तं वपुरात्मनः सा
न तन्निमित्तं समवाप तापम्॥४॥

सा तस्य देवप्रतिमस्य देवी
गर्भेण वंशश्रियमुद्वहन्ती।
श्रमं न लेभे न शुचं न मायां
गन्तुं वनं सा निभृतं चकाङ्क्ष॥५॥

सा लुम्बिनी नाम वनान्तभूमिं
चित्रद्रूमां चैत्ररथाभिरामाम्।
ध्यानानुकूलां विजनामियेष
तस्यां निवासाय नृपं बभाषे॥६॥

आर्याशयां तां प्रवणां च धर्मे
विज्ञाय कौतूहलहर्षपूर्णः।
शिवात् पुराद् भूमिपतिर्जगाम
तत्प्रीतये नापि विहारहेतोः॥७॥

तस्मिन्वने श्रीमति राजपत्नी
प्रसूतिकालं समवेक्षमाणा।
शय्यां वितानोपहितां प्रपेदे
नारीसहस्रैरभिनन्द्यमाना॥८॥

ततः प्रसन्नश्च बभूव पुष्य-
स्तस्याश्च देव्या व्रतसंस्कृतायाः।
पार्श्वात्सुतो लोकहिताय जज्ञे
निर्वेदनं चैव निरामयं च॥९॥

ऊरोर्यथौर्वस्य पृथोश्च हस्ता-
न्मान्धातुरिन्द्रप्रतिमस्य मूर्ध्नः।
कक्षीवतश्चैव भुजांसदेशा-
त्तथाविधं तस्य बभूव जन्म॥१०॥

क्रमेण गर्भादभिनिःसृतः सन्
बभौ च्युतः खादिव योन्यजातः।
कल्पेष्वनेकेषु च भावितात्मा
यः संप्रजानन्सुषुवे न मूढः॥११॥

दीप्त्या च धैर्येण च यो रराज
बालो रविभूमिमिवावतीर्णः।
तथातिदीप्तोऽपि निरीक्ष्यमाणो
जहार चक्षूंषि यथा शशाङ्कः॥१२॥

स हि स्वगात्रप्रभयोज्ज्वलन्त्या
दीपप्रभां भास्करवन्मुमोष।
महार्हजाम्बूनदचारुवर्णो
विद्योतयामास दिशश्च सर्वाः॥१३॥

अनाकुलान्युब्जसमुद्गतानि
निष्पेषवद्व्यायतविक्रमाणि।
तथैव धीराणि पदानि सप्त
सप्तर्षितारासदृशो जगाम॥१४॥

बोधाय जातोऽस्मि जगद्धितार्थ-
मन्त्या भवोत्पत्तिरियं ममेति।
चतुर्दिशं सिंहगतिर्विलोक्य
वाणी च भव्यार्थकरीमुवाच॥१५॥

खात्प्रस्रूते चन्द्रमरीचिशुभ्रे
द्वे वारिधारे शिशिरोष्णवीर्ये।
शरीरसंस्पर्शसुखान्तराय
निपेततुर्मूर्धनि तस्य सौम्ये॥१६॥

श्रीमद्विताने कनकोज्ज्वलाङ्गे
वैडूर्यपादे शयने शयानम्।
यद्गौरवात्काञ्चनपद्महस्ता
यक्षाधिपाः संपरिवार्य तस्थुः॥१७॥

अदृश्यभावाश्च दिवौकसः खे
यस्य प्रभावात्प्रणतैः शीरोभिः।
आधारयन् पाण्डरमातपत्रं
बोधाय जेपुः परमाशिषश्च॥१८॥

महोरगा धर्मविशेषतर्षाद्
बुद्धेष्वतीतेषु कृताधिकाराः।
यमव्यजन् भक्तिविशिष्टनेत्रा
मन्दारपुष्पैः समवाकिरंश्च॥१९॥

तथागतोत्पादगुणेन तुष्टाः
शुद्धाधिवासाश्च विशुद्धसत्त्वाः।
देवा ननन्दुर्विगतेऽपि रागे
मग्नस्य दुःखे जगतो हिताय॥२०॥

यस्य प्रसूतौ गिरिराजकीला
वाताहता नौरिव भूश्चचाल।
सचन्दना चोत्पलपद्मगर्भा
पपात वृष्टिर्गगनादनभ्रात्॥२१॥

वाता ववुः स्पर्शसुखा मनोज्ञा
दिव्यानि वासांस्यवपातयन्तः।
सूर्यः स एवाभ्यधिकं चकाशे
जज्वाल सौम्यार्चिरनीरितोऽग्निः॥२२॥

प्रागुत्तरे चावसथप्रदेशे
कूपः स्वयं प्रादुरभूत्सिताम्बुः
अन्तःपुराण्यागतविस्मयानि
यस्मिन् क्रियास्तीर्थ इव प्रचक्रुः॥२३॥

धर्मार्थिभिर्भूतगणैश्च दिव्यै-
स्तद्दर्शनार्थ वनमापुपूरे।
कौतूहलेनैव च पादपेभ्यः
पुष्पाण्यकालेऽप्यवपातयद्भिः॥२४॥

भूतैरसौम्यैः परित्यक्तहिंसै-
र्नाकारि पीडा स्वगणे परे वा।
लोके हि सर्वाश्च विना प्रयासं
रुजो नराणां शमयांबभूवुः॥२५॥

कलं प्रणेदुः मृगपक्षिणश्च
शान्ताम्बुवाहाः सरितो बभूवुः।
दिशः प्रसेदुर्विमले निरभ्रे
विहायसे दुन्दुभयो निनेदुः॥२६॥

लोकस्य मोक्षाय गुरौ प्रसूते
शमं प्रपेदे जगदव्यवस्थम्।
प्राप्येव नाथं खलु नीतिमन्तम्
एको न मारो मुदमाप लोके॥२७॥

दिव्याद्भुतं जन्म निरीक्ष्य तस्य
धीरोऽपि राजा बहुक्षोभमेतः।
स्नेहादसौ भीतिप्रमोदजन्ये
द्वे वारिधारे मुमुचे नरेन्द्रः॥२८॥

अमानुषी तस्य निशम्य शक्तिं
माता प्रकृत्या करुणार्द्रचित्ता।
प्रीता च भीता च बभूव देवी
शीतोष्णमिश्रेव जलस्य धारा॥२९॥

निरीक्षमाणा भयहेतुमेव
ध्यातुं न शेकुः वनिताः प्रवृद्धाः।
पूताश्च ता मङ्गलकर्म चक्रुः
शिवं ययाचुः शिशवे सुरौघान्॥३०॥

विप्राश्च ख्याताः श्रुतशीलवाग्भिः
श्रुत्वा निमित्तानि विचार्य सम्यक्।
मुखैः प्रफुल्लैश्चकितैश्च दीप्तैः।
भीतप्रसन्नं नृपमेत्य प्रोचुः॥३१॥

शमेप्सवो ये भुवि सन्ति सत्त्वाः।
पुत्रं विनेच्छन्ति गुणं न कञ्चित्।
त्वत्पुत्र एषोऽस्ति कुलप्रदीपः।
नृत्योत्सवं त्वद्य विधेहि राजन्॥३२॥

विहाय चिन्तां भव शान्तचित्तो
मोदस्व वंशस्तव वृद्धिभागी।
लोकस्य नेता तव पुत्रभूतः
दुःखार्दितानां भुवि एष त्राता॥३३॥

दीपप्रभोऽयं कनकोज्ज्वलाङ्गः
सुलक्षणैर्यैस्तु समन्वितोऽस्ति।
निधिर्गुणानां समये स गतां
बुद्धर्षिभावं परमां श्रियं वा॥३४॥

इच्छेदसौ वै पृथिवीश्रियं चेत्
न्यायेन जित्वा पृथिवी समग्राम्।
भूपेषु राजेत यथा प्रकाशः
ग्रहेषु सर्वेषु रवेर्विभाति॥३५॥

मोक्षाय चेद्वा वनमेव गच्छेत्।
तत्त्वेन सम्यक् स विजित्य सर्वान्।
मतान् पृथिव्यां बहुमानमेतः
राजेत शैलेषु यथा सुमेरुः॥३६॥

यथा हिरण्यं शुचि धातुमध्ये
मेरुर्गिरीणां सरसां समुद्रः।
तारासु चन्द्रस्तपतां च सूर्यः
पुत्रस्तथा ते द्विपदेषु वर्यः॥३७॥

तस्याक्षिणी निर्निमिषे विशाले
स्निग्धे च दीप्ते विमले तथैव।
निष्कम्पकृष्णायतशुद्धपक्ष्मे
द्रष्टुं समर्थे खलु सर्वभावान्॥३८॥

कस्मान्नु हेतोः कथितान्भवद्भिः
वरान्गुणान् धारयते कुमारः।
प्रापुर्न पूर्वे मुनयो नृपाश्च
राज्ञेति पृष्टा जगदुस् द्विजास्तम्॥३९॥

ख्यातानि कर्माणि यशो मतिश्च
पूर्व न भूतानि भवन्ति पश्चात्।
गुणा हि सर्वाः प्रभवन्ति हेतोः
निदर्शनान्यत्र च नो निबोध॥४०॥

यद्राजशास्त्रं भृगुरङ्गिरा वा
न चक्रतुर्वशकरावृषी तौ।
तयोः सुतौ सौम्य ससर्जतुस्त-
त्कालेन शुक्रश्च बृहस्पतिश्च॥४१॥

सारस्वतश्चापि जगाद नष्टं
वेदं पुनर्यं ददृशुर्न पूर्वे।
व्यासस्तथैनं बहुधा चकार
न यं वसिष्ठः कृतवानशक्तिः॥४२॥

वाल्मीकिरादौ च ससर्ज पद्यं
जग्रन्थ यन्न च्यवनो महर्षिः।
चिकित्सितं यच्च चकार नात्रिः
पश्चात्तदात्रेय ऋषिर्जगाद॥४३॥

यच्च द्विजत्वं कुशिको न लेभे
तद्गाधिनः सुनूरवाप राजन्।
वेलां समुद्रे सगरश्च दध्रे
नेक्ष्वाकवो यां प्रथमं बबन्धुः॥४४॥

आचार्यकं योगविधौ द्विजाना-
मप्राप्तमन्यैर्जनको जगाम।
ख्यातानि कर्माणि च यानि शौरेः
शूरादयस्तेष्वबला बभूवुः॥४५॥

तस्मात्प्रमाणं न वयो न वंशः
कश्चित्क्वचिच्छ्रैष्ठ्यमुपैति लोके।
राज्ञामृषीणां च हि तानि तानि
कृतानि पुत्रैरकृतानि पूर्वैः॥४६॥

एवं नृपः प्रत्ययितैर्द्विजैस्तै-
राश्वासितश्चाप्यभिनन्दितश्च।
शङ्कामनिष्टां विजहौ मनस्तः
प्रहर्षमेवाधिकमारुरोह॥ ४७॥

प्रीतश्च तेभ्यो द्विजसत्तमेभ्यः
सत्कारपूर्व प्रददौ धनानि।
भूयादयं भूमिपतिर्यथोक्तो
यायाज्जरामेत्य वनानि चेति॥४८॥

अथो निमित्तैश्च तपोबलाच्च
तज्जन्म जन्मान्तकरस्य बुद्ध्वा।
शाक्येश्वरस्यालयमाजगाम
सद्धर्मतर्षादसितो महर्षिः॥४९॥

तं ब्रह्मविद्ब्रह्मविदं ज्वलन्तं
ब्राह्म्या श्रिया चैव तपःश्रिया च।
राज्ञो गुरुर्गौरवसत्क्रियाभ्यां
प्रवेशायामास नरेन्द्रसद्म॥५०॥

स पार्थिवान्तःपुरसंनिकर्ष
कुमारजन्मागतहर्षवेगः।
विवेश धीरो वनसंज्ञयेव
तपःप्रकर्षाच्च जराश्रयाच्च॥५१॥

ततो नृपस्तं मुनिमासनस्थं
पाद्यार्ध्यपूर्वं प्रतिपूज्य सम्यक्।
निमन्त्रयामास यथोपचारं
पुरा वसिष्ठं स इवान्तिदेवः॥५२॥

धन्योऽस्म्यनुग्राह्यमिदं कुलं मे।
यन्मां दिदृक्षुर्भगवानुपेतः।
आज्ञाप्यतां किं करवाणि सौम्य
शिष्योऽस्मि विश्रम्भितुमर्हसीति॥५३॥

एवं नृपेणोपनिमन्त्रितः स-
न्सर्वेण भावेन मुनिर्यथावत्।
स विस्मयोत्फुल्लविशालदृष्टि-
र्गम्भीरधीराणि वचांस्युवाच॥५४॥

महात्मनि त्वय्युपपन्नमेत-
त्प्रियातिथौ त्यागिनि धर्मकामे।
सत्त्वान्वयज्ञानवयोऽनुरूपा
स्निग्धा यदेवं मयि मे मतिः स्यात्॥५५॥

एतच्च तद्येन नृपर्षयस्ते।
धर्मेण सूक्ष्मेण धनान्यवाप्य।
नित्यं त्यजन्तो विधिवद्बभूवु-
स्तपोभिराढ्या विभवैर्दरिद्राः॥५६॥

प्रयोजनं यत्तु ममोपयाने
तन्मे शृणु प्रीतिमुपेहि च त्वम्।
दिव्या मयादित्यपथे श्रुता वा-
ग्बोधाय जातस्तनयस्तवेति॥५७॥

श्रुत्वा वचस्तच्च मनश्च युक्त्वा
ज्ञात्वा निमित्तैश्च ततोऽस्म्युपेतः।
दिदृक्षया शाक्यकुलध्वजस्य
शक्रध्वजस्येव समुच्छ्रितस्य॥५८॥

इत्येतदेवं वचनं निशम्य
प्रहर्षसंभ्रान्तगतिनरेन्द्रः ।
आदाय धात्र्यङ्कगतं कुमारं
संदर्शयामास तपोधनाय॥५९॥

चक्राङ्कपादं स ततो महर्षि-
र्जालावनद्धाङ्गुलिपाणिपादम्।
सोर्णभ्रुवं वारणवस्तिकोशं
सविस्मयं राजसुतं ददर्श॥६०॥

धात्र्यङ्कसंविष्टमवेक्ष्य चैनं
देव्यङ्कसंविष्टमिवाग्निसूनुम्।
बभूव पक्ष्मान्तविचञ्चिताश्रु-
र्निश्वस्य चैव त्रिदिवोन्मुखोऽभूत्॥६१॥

दृष्ट्वासितं त्वश्रुपरिप्लुताक्षं।
स्नेहात्तनूजस्य नृपश्चकम्पे।
सगद्गदं बाष्पकषायकण्ठः
पप्रच्छ स प्राञ्जलिरानताङ्गः॥६२॥

अल्पान्तरं यस्य वपुः सुरेभ्यो
बव्हद्भुतं यस्य च जन्म दीप्तम्।
यस्योत्तमं भाविनमात्थ चार्थ
तं प्रेक्ष्य कस्मात्तव धीर बाष्पः॥६३॥

अपि स्थिरायुर्भगवन् कुमारः
कच्चिन्न शोकाय मम प्रसूतः।
लब्धः कथंचित्सलिलाञ्जलिर्मे
न खल्विमं पातुमुपैति कालः॥६४॥

अप्यक्षयं मे यशसो निधानं
कच्चिद्ध्रुवो मे कुलहस्तसारः।
अपि प्रयास्यामि सुखं परत्र
सुप्तोऽपि पुत्रेऽनिमिषैकचक्षुः॥६५॥

कच्चिन्न मे जातमफुल्लमेव
कुलप्रवालं परिशोषभागि।
क्षिप्रं विभो ब्रूहि न मेऽस्ति शान्तिः
स्नेहं सुते वेत्सि हि बान्धवानाम्॥६६॥

इत्यागतावेगमनिष्टबुद्ध्या
बुद्ध्वा नरेन्द्रं स मुनिर्बभाषे।
मा भून्मतिस्ते नृप काचिदन्या
निःसंशयं तद्यदवोचमस्मि॥६७॥

नास्यान्यथात्वं प्रति विक्रिया मे
स्वां वञ्चनां तु प्रति विक्लवोऽस्मि।
कालो हि मे यातुमयं च जातो
जातिक्षयस्यासुलभस्य बोद्धा॥६८॥

विहाय राज्यं विषयेष्वनास्थ-
स्तीव्रैः प्रयत्नैरधिगम्य तत्त्वम्।
जगत्ययं मोहतमो निहन्तुं
ज्वलिष्यति ज्ञानमयो हि सूर्यः॥६९॥

दुःखार्णवाद्व्याधिविकीर्णफेना-
ज्जरातरङ्गान्मरणोग्रवेगात्।
उत्तारयिष्यत्ययमुह्यमान-
मार्त जगज्ज्ञानमहाप्लवेन॥७०॥

प्रज्ञाम्बुवेगां स्थिरशीलवप्रां
समाधिशीतां व्रतचक्रवाकाम्।
अस्योत्तमां धर्मनदी प्रवृतां।
तृष्णार्दितः पास्यति जीवलोकः॥७१॥

दुःखार्दितेभ्यो विषयावृतेभ्यः
संसारकान्तारपथस्थितेभ्यः।
आख्यास्यति ह्येष विमोक्षमार्ग
मार्गप्रनष्टेभ्य इवाध्वगेभ्यः॥७२॥

विदह्यमानाय जनाय लोके
रागाग्निनायं विषयेन्धनेन।
प्रल्हादमाधास्यति धर्मवृष्ट्या
वृष्ट्या महामेघ इवातपान्ते॥७३॥

तृष्णार्गलं मोहतमःकपाटं
द्वारं प्रजानामपयानहेतोः।
विपाटयिष्यत्ययमुत्तमेन
सद्धर्मताडेन दुरासदेन॥७४॥

स्वैर्मोहपाशैः परिवेष्टितस्य
दुःखाभिभूतस्य निराश्रयस्य।
लोकस्य संबुध्य च धर्मराजः
करिष्यते बन्धनमोक्षमेषः॥७५॥

तन्मा कृथाः शोकमिमं प्रति त्व-
मस्मिन्स शोच्योऽस्ति मनुष्यलोके।
मोहेन वा कामसुखैर्मदाद्वा
यो नैष्ठिकं श्रोष्यति नास्य धर्मम्॥७६॥

भ्रष्टस्य तस्माच्च गुणादतो मे
ध्यानानि लब्ध्वाप्यकृतार्थतैव।
धर्मस्य तस्याश्रवणादहं हि
मन्ये विपत्तिं त्रिदिवेऽपि वासम्॥७७॥

इति श्रुतार्थः ससुहृत्सदार-
स्त्यक्त्वा विषादं मुमुदे नरेन्द्रः।
एवंविधोऽयं तनयो ममेति
मेने स हि स्वामपि सारवत्ताम्॥७८॥

आर्षेण मार्गेण तु यास्यतीति
चिन्ताविधेयं हृदयं चकार।
न खल्वसौ न प्रियधर्मपक्षः।
संताननाशात्तु भयं ददर्श॥७९॥

अथ मुनिरसितो निवेद्य तत्त्वं
सुतनियतं सुतविक्लवाय राज्ञे।
सबहुमतुमुदीक्ष्यमाणरूपः
पवनपथेन यथागतं जगाम॥८०॥

कृतमितिरनुजासुतं च दृष्ट्वा
मुनिवचनश्रवणे च तन्मतौ च।
बहुविधमनुकम्पया स साधुः
प्रियसुतवद्विनियोजयांचकार॥८१॥

नरपतिरपि पुत्रजन्मतुष्टो
विषयगतानि विमुच्य बन्धनानि।
कुलसदृशमचीरकरद्यथाव-
त्प्रियतनयस्तनयस्य जातकर्म॥८२॥

दशसु परिणतेष्वहःसु चैव
प्रयतमनाः परया मुदा परीतः।
अकुरुत जपहोममङ्गलाद्याः
परमभवाय सुतस्य देवतेज्याः॥८३॥

अपि च शतसहस्रपूर्णसंख्याः
स्थिरबलवत्तनयाः सहेमशृङ्गीः।
अनुपगतजराः पयस्विनीर्गाः
स्वयमददात्सुतवृद्धये द्विजेभ्यः॥८४॥

बहुविधविषयास्ततो यतात्मा
स्वहृदयतोषकरीः क्रिया विधाय।
गुणवति नियते शिवे मुहूर्ते
मतिमकरोन्मुदितः पुरप्रवेशे॥८५॥

द्विरदरदमयीमथो महार्हा
सितसितपुष्पभृतां मणिप्रदीपाम्।
अभजत शिविकां शिवाय देवी
तनयवती प्रणिपत्य देवताभ्यः॥८६॥

पुरमथ पुरतः प्रवेश्य पत्नीं
स्थविरजनानुगतामपत्यनाथाम्।
नृपतिरपि जगाम पौरसंघै-
र्दिवममरैर्मघवानिवार्च्यमानः॥८७॥

भवनमथ विगाह्य शाक्यराजो
भव इव षण्मुखजन्मना प्रतीतः।
इदमिदमिति हर्षपूर्णवक्त्रो
बहुविधपुष्टियशस्करं व्यधत्त॥८८॥

इति नरपतिपुत्रजन्मवृद्ध्या
सजनपदं कपिलाव्हयं पुरं तत्।
धनदपुरमिवाप्सरोऽवकीर्ण
मुदितमभून्नलकूबरप्रसूतौ॥८९॥

इति बुद्धचरिते महाकाव्ये
भगवत्प्रसूतिर्नाम प्रथमः सर्गः॥१॥
  `,
        'shalistamba': `शालिस्तम्बसूत्रम् ।

एवं मया श्रुतम् । एकस्मिन् समये भगवान् राजगृहे विहरति स्म गृध्रकूटे पर्वते महता भिक्षुसंघेन सार्धमर्धत्रयोदशभिर्भिक्षुसहस्रैः संबहुलैश्च बोधिसत्त्वमहासत्त्वैः । अथायुष्मान् शारिपुत्रो येन मैत्रेयस्य बोधिसत्त्वस्य महासत्त्वस्य चंक्रमः, तेनोपसमक्रमीत् । उपसंक्रम्य अन्योन्यं संमोदनीयां कथां बहुविधां व्यतिसारयित्वा उभौ शिलातले उपाविशताम् ॥

अथायुष्मान् शारिपुत्रो मैत्रेयं बोधिसत्त्वं महासत्त्वमेतदवोचत्-अद्यात्र शालिस्तम्बमवलोक्य मैत्रेय भगवता भिक्षुभ्यः सूत्रमिदमुक्तम्-यो भिक्षवः प्रतीत्यसमुत्पादं पश्यति, स धर्मं पश्यति । यो धर्मं पश्यति, स बुद्धं पश्यति । इत्युक्त्वा भगवांस्तूष्णीं बभूवं । अथ मैत्रेय सुगतोक्तसूत्रान्तस्य अर्थः कतमः ? प्रतीत्यसमुत्पादः कतमः ? धर्म कतमः ? बुद्धः कतमः ? कथं प्रतीत्यसमुत्पादं पश्यन् धर्मं पश्यति ? कथं धर्मं पश्यन् बुद्धं पश्यति ?

एवमुक्ते मैत्रेयो बोधिसत्त्वो महासत्त्वः आयुष्मन्तं शारद्वतीपुत्रमेतदवोचत्-अत्र यदुक्तं भदन्त शारिपुत्र भगवता धर्मस्वामिना सर्वज्ञेन-यो भिक्षवः प्रतीत्यसमुत्पादं पश्यति, स धर्मं पश्यति । यो धर्मं पश्यति, स बुद्धं पश्यति इति, तत्र कतमः प्रतीत्यसमुत्पादो नाम ? प्रतीत्यसमुत्पादो नाम यदिदम्-अस्मिन् सति इदं भवति, अस्योत्पादादिदमुत्पद्यते । यदुत अविद्याप्रत्ययाः संस्काराः । संस्कारप्रत्ययं विज्ञानम् । विज्ञानप्रत्ययं नामरूपम् । नामरूपप्रत्ययं षडायतनम् । षडायतनप्रत्ययः स्पर्शः । स्पर्शप्रत्यया वेदना । वेदनाप्रत्यया तृष्णा । तृष्णाप्रत्ययमुपादानम् । उपादानप्रत्ययो भवः । भवप्रत्यया जाति । जातिप्रत्यया जरामरणशोकपरिदेवदुःखदौर्मनस्योपायासाः संभवन्ति । एवमस्य केवलस्य महतो दुःखस्कन्धस्य समुदयो भवति । तत्र अविद्यानिरोधात् संस्कारनिरोधः । संस्कारनिरोधाद्विज्ञाननिरोधः । विज्ञाननिरोधान्नामरूपनिरोधः । नामरूपनिरोधात् षडायतननिरोधः । षडायतननिरोधात् स्पर्शनिरोधः । स्पर्शनिरोधात् वेदनानिरोधः । वेदनानिरोधात् तृष्णानिरोधः । तृष्णानिरोधादुपादाननिरोधः । उपादाननिरोधाद्भवनिरोधः । भवनिरोधाज्जातिनिरोधः । जातिनिरोधाज्जरामरणशोकपरिदेवदुःखदौर्मनस्योपायासा निरुध्यन्ते । एवमस्य केवलस्य महतो दुःखस्कन्धस्य निरोधो भवति । अयमुच्यते प्रतीत्यसमुत्पादो भगवता ॥

कतमो धर्मः ? आर्याष्टाङ्गिको मार्गः । तद्यथा-सम्यग्दृष्टिः सम्यक्संकल्पः सम्यग्वाक् सम्यक्कर्मान्तः सम्यगाजीवः सम्यग्व्यायामः सम्यक्स्मृतिः सम्यक्समाधिः । अयमुक्तो भगवता आर्याष्टाङ्गिको मार्गः फललाभनिर्वाणैकसंगृहीतो धर्मः ॥

तत्र कतमो बुद्धो भगवान् ? यः सर्वधर्मावबोधाद्बुद्ध उच्यते, स आर्यप्रज्ञानेत्रः धर्मकायसमन्वितः शैक्षाशैक्षधर्मानिमान् पश्यति ॥

तत्र कथं प्रतीत्यसमुत्पादं पश्यति ? इहोक्तं भगवता-य इमं प्रतीत्यसमुत्पादं सततसमितम्, अजीवं निर्जीवं यथावदविपरीतमजातमभूतमकृतमसंस्कृतमप्रतिघमनालम्बनं शिवमभयमनाहार्यमव्ययमव्युपशमस्वभावं पश्यति, (स धर्मं पश्यति) । यस्तु एवं धर्मं सततसमितमजीवं निर्जीवं यथावदविपरीतमजातमभूतमकृतमसंस्कृतमप्रतिघमनालम्बनं शिवमनाहार्यमव्ययमव्युपशमस्वभावं पश्यति, सोऽनुत्तरधर्मशरीरं बुद्धं पश्यति । आर्यधर्माभिसमये सम्यग्ज्ञानोपनयेनैव ॥

प्रतीत्यसमुत्पाद इति कस्मादुच्यते ? सहेतुकः सप्रत्ययो नाहेतुको नाप्रत्ययः, तस्मात् प्रतीत्यसमुत्पाद इत्युच्यते । तत्र भगवता प्रतीत्यसमुत्पादलक्षणं संक्षेपेणोक्तमिदंप्रत्ययताफलम् । उत्पादाद्वा तथागतानामनुत्पादाद्वा स्थितैवेषा धर्माणां धर्मता यावद्यैषा धर्मता धर्मस्थितिता धर्मनियामता प्रतीत्यसमुत्पादसमता तथता अविपरीततथता अनन्यतथता भूतता सत्यता अविपरीतता अविपर्ययता इति ॥

अथ च पुनरयं प्रतीत्यसमुत्पादो द्वाभ्यां कारणाभ्यामुत्पद्यते । कतमाभ्यां द्वाभ्याम् ? यदिदं हेतूपनिबन्धतः प्रत्ययोपनिबन्धतश्च । सोऽपि द्विविधो द्रष्टव्यः-बाह्यश्च आध्यात्मिकश्च । तत्र बाह्यस्य प्रतीत्यसमुत्पादस्य हेतूपनिबन्धः कतमाः ? यदिदं बीजादङ्कुरः । अङ्कुरात्पत्रम् । पत्रात्काण्डम् । काण्डान्नालम् । नालाद्गण्डः । गण्डाद्गर्भम् । गर्भाच्छूकः । शूकात्पुष्पम् । पुष्पात् फलम् । असति बीजे अङ्कुरो न भवति, यावदसति पुष्पे फलं न भवति । सति तु बीजे अङ्कुरस्याभिनिर्वृत्तिर्भवति, एवं यावत् सति पुष्पे फलस्याभिनिर्वृत्तिर्भवति । तत्र बीजस्य नैवं भवति-अहमङ्कुरमभिनिर्वर्तयामीति । अङ्कुरस्यापि नैवं भवति-अहं बीजेनाभिनिर्वर्तित इति । एवं यावत् पुष्पस्य नैवं भवति-अहं फलमभिनिर्वर्तयामीति । फलस्यापि नैवं भवति-अहं पुष्पेणाभिनिर्वर्तितमिति । अथ पुनः बीजे सति अङ्कुरस्याभिनिर्वृत्तिर्भवति प्रादुर्भावः । एवं यावत् पुष्पे सति फलस्याभिनिर्वृत्तिर्भवति प्रादुर्भावः । एवं बाह्यस्य प्रतीत्यसमुत्पादस्य हेतूपनिबन्धो द्रष्टव्यः ॥

कथं बाह्यस्य प्रतीत्यसमुत्पादस्य प्रत्ययोपनिबन्धो द्रष्टव्यः ? षण्णां धातूना समुदायात् । कतमेषां षण्णां समवायात् ? यदिदं पृथिव्यप्तेजोवाय्वाकाशऋतुधातुसमवायाद्बाह्यस्य प्रतीत्यसमुत्पादस्य प्रत्ययोपनिबन्धो द्रष्टव्यः । तत्र पृथिवीधातुर्बीजस्य संधारणकृत्यं करोति । अब्धातुर्बीजं स्नेहयति । तेजोधातुर्बीजं परिपाचयति । वायुधातुर्बीजमभिनिर्हरति । आकाशधातुर्बीजस्यानावरणकृत्यं करोतीति । ऋतुरपि बीजस्य परिणामनाकृत्यं करोति । असत्सु एषु प्रत्ययेषु बीजादङ्कुरस्याभिनिर्वृत्तिर्न भवति । यदा बाह्यश्च पृथिवीधातुरविकलो भवति, एवमप्तेजोवाय्वाकाशऋतुधातवश्चाविकला भवन्ति, ततः सवषां समवायाद्बीजे निरुध्यमाने अङ्कुरस्याभिनिर्वृत्तिर्भवति । तत्र पृथिवीधातोर्नैवं भवति-अहं बीजस्य संधारणकृत्यं करोमीति । एवमब्धातोरपि नैवं भवति-अहं बीजं स्नेहयामीति । तेजोधातोरपि नैवं भवति-अहं बीजं परिपाचयामीति । वायुधातोरपि नैवं भवति-अहं बीजमभिनिर्हरामीति । आकाशधातोरपि नैवं भवति-अहं बीजस्यानावरणकृत्यं करोमीति । ऋतोरपि नैवं भवति-अहं बीजस्य परिणामनाकृत्यं करोमीति । बीजस्यापि नैवं भवति-अहं बीजं (अङ्कुरं?) अभिनिर्वर्तयामीति । अङ्कुरस्यापि नैवं भवति-अहमेभिः प्रत्ययैरभिनिर्वर्तित इति । अथ पुनः सत्सु एतेषु प्रत्ययेषु बीजे निरुध्यमाने अङ्कुरस्याभिनिर्वृत्तिएभवति । एवं यावत् पुष्पे सति फलस्याभिनिर्वृत्तिर्भवति । स च अङ्कुरो न स्वयंकृतो न परकृतो नोभयकृतो नेश्वरकृतो न कालपरिणामितो न प्रकृतिसंभूतो ( न चैककारणाधीनो) नाप्यहेतुसमुत्पन्नः । अथ पुनः पृथिव्यप्तेजोवाय्वाकाशऋतुधातुसमवायाद् बीजे निरुध्यमाने अङ्कुरस्याभिनिर्वृत्तिर्भवति । एवं बाह्यस्य प्रतीत्यसमुत्पादस्य प्रत्ययोपनिबन्धो द्रष्टव्यः ॥

तत्र बाह्यः प्रतीत्यसमुत्पादः पञ्चभिराकारैर्द्रष्टव्यः । कतमैः पञ्चभिः ? न शाश्वततः, नोच्छेदतः, न संक्रान्तितः, परीत्तहेतुतो विपुलफलाभिनिर्वृत्तितः, तत्सदृशानुप्रबन्धतश्च । कथं न शाश्वतत इति ? यस्मादन्योऽङ्कुरः अन्यद्बीजम् । न च य एवाङ्कुरः तदेव बीजम् । न च निरुद्धाद्बीजादङ्कुर उत्पद्यते नाप्यनिरुद्धात् । बीजं पुनर्निरुध्यते, तदैवाङ्कुरश्चोत्पद्यते । तस्मान्न शाश्वततः । कथं नोच्छेदतः ? न च पूर्वनिरुद्धाद् बीजादङ्कुरो निष्पद्यते । नाप्यनिरुद्धात् । अपि च बीजं च निरुध्यते, तस्मिन्नेव समये अङ्कुर उत्पद्यते तुलादण्डोन्नामावनामवत् । अतो नोच्छेदतः ॥ कथं न संक्रान्तितः ? विसदृशो बीजादङ्कुर इति । अतो न संक्रान्तितः ॥ कथं परीत्तहेतुतो विपुलफलाभिनिर्वृत्तितः ? परीत्तं बीजमुप्यते, विपुलफलमभिनिर्वर्तयतीति । अतः परीत्तहेतुतो विपुलफलाभिनिर्वृत्तितः ॥ कथं तत्सदृशानुप्रबन्धतः ? यादृशं बीजमुप्यते, तादृशं फलमभिनिर्वर्तयतीति । अतस्तत्सदृशानुप्रबन्धतश्चेति ॥ एवं बाह्यः प्रतीत्यसमुत्पादः पञ्चभिराकारैर्द्रष्टव्यः ॥

एवमाध्यात्मिकोऽपि प्रतीत्यसमुत्पादो द्वाभ्यां कारणाभ्यामुत्पद्यते । कतमाभ्यां द्वाभ्याम् ? यदिदं हेतूपनिबन्धतः प्रत्ययोपनिबन्धतश्च । तत्राध्यात्मिकस्य प्रतीत्यसमुत्पादस्य हेतूपनिबन्धः कतमः ? यदिदमविद्याप्रत्ययाः संस्काराः, यावज्जातिप्रत्ययं जरामरणमिति । अविद्या चेन्नाभविष्यत्, नैव संस्काराः प्रज्ञास्यन्ते । एवं यावज्जातिश्चेन्नाभविष्यत्, जरामरणं न प्रज्ञास्यते । अथ सत्यामविद्यायां संस्काराणामभिनिर्वृत्तिर्भवति । एवं यावज्जात्यां सत्त्यां जरामरणस्याभिनिर्वृत्तिर्भवति । तत्र अविद्याया नैवं भवति-अहं संस्कारानभिनिर्वर्तयामीति । संस्काराणामपि नैवं भवति-वयमविद्यया अभिनिर्वतिता इति । एवं यावज्जातेरपि नैवं भवति-अहं जरामरणमभिनिर्वर्तयामीति । जरामरणस्यापि नैवं भवति-अहं जात्याभिनिर्वर्तितमिति । अथ च सत्यामविद्यायां संस्काराणामभिनिर्वृत्तिर्भवति प्रादुर्भावः । एवं यावज्जात्यां सत्यां जरामरणस्याभिनिर्वृत्तिर्भवति प्रादुर्भावः । एवमाध्यात्मिकस्य प्रतीत्यसमुत्पादस्य हेतूपनिबन्धो द्रष्टव्यः ॥

कथमाध्यात्मिकस्य प्रतीत्यसमुत्पादस्य प्रत्ययोपनिबन्धो द्रष्टव्यः ? षण्णां धातूनां समवायात् । कतमेषां षण्णां धातूनां समवायात् ? यदिदं पृथिव्यप्तेजोवाय्वाकाशविज्ञानधातूनां समवायादाध्यात्मिकस्य प्रतीत्यसमुत्पादस्य प्रत्ययोपनिबन्धो द्रष्टव्यः । तत्र आध्यात्मिकस्य प्रतीत्यसमुत्पादस्य पृथिवीधातुः कतमः ? योऽयं कायस्य संश्लेषतः कठिनभावमभिनिर्वर्तयति, अयमुच्यते पृथिवीधातुः । यः कायस्य अनुपरिग्रहकृत्यं करोति, अयमुच्यतेऽब्धातुः । यं कायस्य अशितपीतभक्षितं परिपाचयति, अयमुच्यते तेजोधातुः । यं कायस्य आश्वासप्रश्वासकृत्यं करोति, अयमुच्यते वायुधातुः । यं कायस्यान्तःशौषिर्यमभिनिर्वर्तयति, अयमुच्यते आकाशधातुः । य कायस्य नामरूपाङ्कुरमभिनिर्वर्तयति, नडकलापयोगेन, पञ्चविज्ञानकायसंयुक्तं सास्रवं च मनोविज्ञानम्, अयमुच्यते विज्ञानधातुः । तत्र असतामेषां प्रत्ययानां कायस्योत्पत्तिर्नं भवति । यदा आध्यात्मिकः पृथिवीधातुरविकलो भवति, एवमप्तेजोवाय्वाकाशविज्ञानधातवश्च अविकला भवन्ति, ततः सर्वेषां समवायात् कायस्याभिनिर्वृत्तिर्भवति । तत्र पृथिवीधातोर्नैवं भवति-अहं कायस्य संश्लेषतः कठिनभावमभिनिर्वर्तयामीति । अब्धातोर्नैवं भवति-अहं कायस्य अनुपरिग्रहकृत्यं करोमीति । तेजोधातोरपि नैवं भवति-अहं कायस्य अशितपीतभक्षितं परिपाचयामीति । वायुधातोर्नैवं भवति-अहं कायस्य आश्वासप्रश्वासकृत्यं करोमीति । आकाशधातोर्नैवं भवति-अहं कायस्यान्तःशौषिर्यमभिनिर्वर्तयामीति । विज्ञानधातोर्नैवं भवति-अहं कायस्य नामरूपमभिनिर्वर्तयामीति । कायस्यापि नैवं भवति-अहमेभिः प्रत्ययैर्जनित इति । अथ च सत्सु एषु प्रत्ययेषु कायस्योत्पत्तिर्भवति ॥

तत्र पृथिवीधातुर्नात्मा न सत्त्वो न जीवो न जन्तुः न मनजो न मानवो न स्त्री न पुमान् न नपुंसकं न चाहं न मम न चान्यस्य कस्यचित् । एवमब्धातुस्तेजोधातुर्वायुधातुराकाशधातुर्विज्ञानधातुः नात्मा न सत्त्वो न जीवो न जन्तुः न मनुजो न मानवो न स्त्री न पुमान् न नपुंसकं न चाहं न मम न चान्यस्य कस्यचित् ॥

तत्र अविद्या कतमा ? या एषामेव षण्णां धातूनामेकसंज्ञा पिण्डसंज्ञा नित्यसंज्ञा ध्रुवसंज्ञा शाश्वतसंज्ञा सुखसंज्ञा आत्मसंज्ञा सत्त्वजीवजन्तुपोषपुरुषपुद्गलसंज्ञा मनुजमानवसंज्ञा अहंकारममकारसंज्ञा, एवमादि विविधमज्ञानम् । इयमुच्यते अविद्येति । एवमविद्यायां सत्यां विषयेषु रागद्वेषमोहाः प्रवर्तन्ते । तत्र ये रागद्वेषमोहा विषयेषु, अमी (अविद्याप्रत्ययाः) संस्कारा इत्युच्यन्ते । वस्तुप्रतिविज्ञप्तिर्विज्ञानम् । विज्ञानसहभुवश्चत्वारः स्कन्धा अरूपिणः उपादानाख्याः तन्नाम । रूपं चत्वारि महाभूतानि तानि चोपादाय रूपम् । तच्च नाम तच्च रूपमैकध्यमभिसंक्षिप्य तन्नामरूपम् । नामरूपसंनिश्रितानि इन्द्रियाणि षडायतनम् । त्रयाणां धर्माणां संनिपातः स्पर्शः । स्पर्शानुभवो वेदना । वेदनाध्यवसानं तृष्णा । तृष्णावैपुल्यमुपादानम् । उपादाननिर्जातं पुनर्भवजनकं कर्म भवः । भवहेतुकः स्कन्धप्रादुर्भावो जातिः । जातस्य स्कन्धपरिपाको जरा । जीर्णस्य स्कन्धस्य विनाशो मरणम् । म्रियमाणस्य संमूढस्य साभिष्वङ्गस्य अन्तःपरिदाहः शोकः । शोकोत्थमालपनं परिदेवः । पञ्चविज्ञानकायसंयुक्तमसातमनुभवनं दुःखम् । मनसिकारसंयुक्तं मानसं दुःखं दौर्मनस्यम् । ये चापि अन्ये एवमादयः क्लेशाः, ते उपायासा इति ॥

तत्र महान्धकारार्थेन अविद्या । अभिसंस्कारार्थेन संस्काराः । विज्ञापनार्थेन विज्ञानम् । अन्योन्योपस्तम्भनार्थेन नामरूपम् । आयद्वारार्थेन षडायतनम् । स्पर्शनार्थेन स्पर्शः । अनुभवनार्थेन वेदना । परितर्षणार्थेन तृष्णा । उपादानर्थेन उपादानम् । पुनर्भवजननार्थेन भवः । स्कन्धप्रादुर्भावार्थेन जातिः । स्कन्धपरिपाकार्थेन जरा । विनाशार्थेन मरणम् । शोचनार्थेन शोकः । वचनपरिदेवनार्थेन परिदेवः । कायसंपीडनार्थेन दुःखम् । चित्तसंपीडनार्थेन दौर्मनस्यम् । उपक्लेशार्थेन उपायासाः ॥

पुनरपरम्-तत्त्वेऽप्रतिपत्तिर्मिथ्याप्रतिपत्तिरज्ञानमविद्या । एवमविद्यायां सत्यां त्रिविधाः संस्कारा अभिनिर्वर्तन्ते-पुण्योपगा अपुण्योपगा आनेञ्ज्योपगाः । तत्र पुण्योपगानां संस्काराणां पुण्योपगमेव विज्ञानं भवति । अपुण्योपगानां संस्काराणामपुण्योपगमेव विज्ञानं भवति । आनेञ्ज्योपगानां संस्काराणामानेञ्ज्योपगमेव विज्ञानं भवति । इदमुच्यते संस्कारप्रत्ययं विज्ञानमिति । विज्ञानसहभुवश्चत्वारोऽरूपिणः स्कन्धा नामरूपम् । तद्विज्ञानप्रत्ययं नामरूपमुच्यते । नामरूपविवृद्ध्या षड्भिरायतनद्वारैः कृत्यक्रियाः प्रवर्तन्ते । तन्नामरूपप्रत्ययं षडायतनमित्युच्यते । षड्भ्यश्चायतनेभ्यः षट् स्पर्शकायाः प्रवर्तन्ते । अयं षडायतनप्रत्ययः स्पर्श इत्युच्यते । यज्जातीयः स्पर्शो भवति, तज्जातीया वेदना प्रवर्तते । इयमुच्यते स्पर्शप्रत्यया वेदनेति । यस्तां वेदनां विशेषेणास्वादयति अभिनन्दति अध्यवस्यति अध्यवसाय तिष्ठति, सा वेदनाप्रत्यया तृष्णेत्युच्यते । आस्वादनाभिनन्दनाध्यवसानाध्यवसायस्थानादात्मप्रियरूपसातरूपैर्वियोगो मा भूदिति नित्यमपरित्यागाय यैवं प्रार्थना, इदमुच्यते तृष्णाप्रत्ययमुपादानम् । एवं प्रार्थयमानः पुनर्भवजनकं कर्म समुत्थापयति कायेन वाचा मनसा च, स उपादानप्रत्ययो भव इत्युच्यते । तत्कर्मनिर्जातानां पञ्चस्कन्धानामभिनिर्वृत्तिर्या, सा भवप्रत्यया जातिरित्युच्यते । जात्याभिनिर्वृत्तानां स्कन्धानामुपचयनपरिपाकाद्विनाशो भवति, तदिदं जातिप्रत्ययं जरामरणमित्युच्यते ॥

एवमयं द्वादशाङ्गः प्रतीत्यसमुत्पादः अन्योन्यहेतुकः अन्योन्यप्रत्ययः । न नित्यो नानित्यो न संस्कृतो नासंस्कृतो नाहेतुको नाप्रत्ययो न वेदयिता न क्षयधर्मो न विनाशधर्मो न निरोधधर्मोऽनादिकालप्रवृत्तोऽनुच्छिन्नोऽप्रवर्तते नदीस्रोतवत् ॥

यद्ययं द्वादशाङ्गः प्रतीत्यसमुत्पादोऽन्योन्यहेतुकोऽन्योन्यप्रत्ययः, न नित्यो नानित्यो न संस्कृतो नासंस्कृतो नाहेतुको नाप्रत्ययो न वेदयिता न क्षयधर्मो न विनाशधर्मो न निरोधधर्मोऽनादिकालप्रवृत्तोऽनुच्छिन्नोऽनुप्रवर्तते नदीस्रोतवत्, अथ च इमान्यस्य द्वादशाङ्गस्य प्रतीत्यसमुत्पादस्य चत्वारि अङ्गानि संघातक्रियायै हेतुत्वेन प्रवर्तन्ते । कतमानि चत्वारि ? यदुत अविद्या तृष्णा कर्म विज्ञानं च । तत्र विज्ञानं बीजस्वभावत्वेन हेतुः । कर्म क्षेत्रस्वभावेन हेतुः । अविद्या तृष्णा च क्लेशस्वभावत्वेन हेतुः । तत्र कर्मक्लेशा विज्ञानबीजं जनयन्ति । तत्र कर्म विज्ञानबीजस्य क्षेत्रकार्यं करोति । तृष्णा विज्ञानबीजं स्नेहयति । अविद्या विज्ञानबीजमवकिरति । असतामेषां प्रत्ययानां विज्ञानबीजस्याभिनिर्वृत्तिर्न भवति । तत्र कर्मणो नैवं भवति-अहं विज्ञानबीजस्य क्षेत्रकार्यं करोमीति । तृष्णाया अपि नैवं भवति-अहं विज्ञानबीजं स्नेहयामीति । अविद्याया अपि नैवं भवति-अहं विज्ञानबीजमवकिरामीति । विज्ञानबीजस्यापि नैवं भवति-अहमेभिः प्रत्ययैर्जनितमिति । अथ च विज्ञानबीजं कर्मक्षेत्रप्रतिष्ठितं तृष्णास्नेहाभिष्यन्दितमविद्यया स्ववकीर्णं विरोहति । तत्रतत्र उपपत्त्यायतनप्रतिसंधौ मातुःकुक्षौ नामरूपाङ्कुरमभिनिर्वर्तयति । स च नामरूपाङ्कुरो न स्वयंकृतो न परकृतो नोभयकृतो नेश्वरकृतो न कालपरिणामितो न प्रकृतिसंभूतो न चैककारणाधीनो नाप्यहेतुसमुत्पन्नः । अथ च मातापितृसंयोगदृतुसमवायादन्येषां च प्रत्ययानां समवायात् तत्र तत्र आस्वादविद्धं विज्ञानबीजमुपपत्त्यायतनप्रतिसंघौ मातुः कुक्षौ नामरूपाङ्कुरमभिनिर्वर्तयति, अस्वामिकेषु धर्मेषु अममेषु अपरिग्रहेषु आकाशसमेषु मायालक्षणस्वभावेषु हेतुप्रत्ययानामवैकल्यात् । तद्यथा-पञ्चभिः कारणैः चक्षुर्विज्ञानमुत्पद्यते । कतमैः पञ्चभिः ? यदुत चक्षुः प्रतीत्य रूपं च आलोकं च आकाशं च तज्जमनसिकारं च प्रतीत्य उत्पद्यते चक्षुर्विज्ञानम् । तत्र चक्षुर्विज्ञानस्य चक्षुराश्रयकृत्यं करोति । रूपं चक्षुर्विज्ञानस्य आलम्बनकृत्यं करोति । आलोकः अवभासकृत्यं करोति । आकाशमनावरणकृत्यं करोति । तज्जमनसिकारः समन्वाहारकृत्यं करोति । असतामेषां प्रत्ययानां चक्षुर्विज्ञानं नोत्पद्यते । यदा तु चक्षुराध्यात्मिकमायतनमविकलं भवति, एवं रूपालोकाकाशतज्जमनसिकाराश्च अविकला भवन्ति, ततः सर्वेषां समवायाच्चक्षुर्विज्ञानमुत्पद्यते । तत्र चक्षुषो नैवं भवति-अहं चक्षुर्विज्ञानस्याश्रयकृत्यं करोमीति । रूपस्यापि नैवं भवति-अहं चक्षुर्विज्ञानस्य आलम्बनकृत्यं करोमीति । आलोकस्यापि नैवं भवति-अहं चक्षुर्विज्ञानस्य अवभासकृत्यं करोमीति । आकाशस्यापि नैवं भवति-अहं चक्षुर्विज्ञानस्य अनावरणकृत्यं करोमीति । तज्जमनसिकारस्यापि नैवं भवति-अहं चक्षुर्विज्ञानस्य समन्वाहारकृत्यं करोमीति । चक्षुर्विज्ञानस्यापि नैवं भवति-अहमेभिः प्रत्ययैर्जनितमिति । अथ च पुनः सत्सु एषु प्रत्ययेषु चक्षुर्विज्ञानस्योत्पत्तिर्भवति । एवं शेषाणामिन्द्रियाणां यथायोगं योज्यम् ॥

तत्र न कश्चिद्धर्मोऽस्माल्लोकात् परलोकं संक्रामति । अस्ति च कर्मफलप्रतिविज्ञप्तिः, हेतुप्रत्ययानामवैकल्यात् । तद्यथा सुपरिशुद्धे आदर्शमण्डले मुखप्रतिबिम्बकं दृश्यते । न च तत्र आदर्शमण्डले मुखं संक्रामति । अस्ति च मुखप्रतिविज्ञप्तिः, हेतुप्रत्ययानामवैकल्यात् । एवमस्माल्लोकात् न कश्चित् च्युतः, नाप्यन्यत्रोपपन्नः । अस्ति च कर्मफलप्रतिविज्ञप्तिः, हेतुप्रत्ययानामवैकल्यात् । तद्यथा चन्द्रमण्डलं चत्वारिंशद्योजनशतमूर्ध्वं व्रजति । अथ च पुनः परीत्तेऽभ्युदकभाजने चन्द्रस्य प्रतिबिम्बं दृश्यते । न च चन्द्रमण्डलं तस्मात्स्थानाच्च्युतम्, परीत्ते उदकस्य भाजने संक्रान्तं भवति। अस्ति च चन्द्रमण्डलप्रतिविज्ञप्तिः, हेतुप्रत्ययानामवैकल्यात् । एवमस्माल्लोकान्न कश्चित् च्युतः, नाप्यन्यत्रोपपन्नः । अस्ति च कर्मफलप्रतिविज्ञप्तिः, हेतुप्रत्ययानामवैकल्यात् ॥

तद्यथा अग्निरुपादानप्रत्यये सति ज्वलति, उपादानवैकल्यान्न ज्वलति, एवमेव कर्मक्लेशजनितं विज्ञानबीजं तत्र तत्र उपपत्त्यायतनप्रतिसंघौ मातुः कुक्षौ नामरूपाङ्कुरमभिनिर्वर्तयति, अस्वामिकेषु धर्मेषु अममेषु अपरिग्रहेषु आकाशसमेषु मायालक्षणस्वभावेषु हेतुप्रत्ययानामवैकल्यात् । एवं आध्यात्मिकस्य प्रतीत्यसमुत्पादस्य प्रत्ययोपनिबन्धो द्रष्टव्यः ॥

तत्र आध्यात्मिकः प्रतीत्यसमुत्पादः पञ्चभिराकारैर्द्रष्टव्यः । कतमैः पञ्चभिः ? न शाश्वततः, नोच्छेदतः, न संक्रान्तितः, परीत्तहेतुतो विपुलफलाभिनिर्वृत्ततः, तत्सदृशानुप्रबन्धतश्चेति । कथं न शाश्वततः ? यस्मादन्ये मारणान्तिकाः स्कन्धाः, अन्ये औपपत्त्यंशिकाः स्कन्धाः, न तु य एवं मारणान्तिकाः स्कन्धाः, त एव औपपत्त्यंशिकाः । अपि तु मारणान्तिकाः स्कन्धा निरुध्यन्ते, तस्मिन्नेव च समये औपपत्त्यंशिकाः स्कन्धाः प्रादुर्भवन्ति । अतो न शाश्वततः ॥ कथं नोच्छेदतः? न च पूर्वनिरुद्धेषु मारणान्तिकेषु स्कन्धेषु औपपत्त्यंशिकाः स्कन्धाः प्रादुर्भवन्ति, नाप्यनिरुद्धेषु । अपि तु मारणान्तिकाः स्कन्धा निरुध्यन्ते, तस्मिन्नेव च समये औपपत्त्यंशिकाः स्कन्धाः प्रादुर्भवन्ति तुलादण्डोन्नामावनामवत् । अतो नोच्छेदतः ॥ कथं न संक्रान्तितः ? विसदृशाः सत्त्वनिकायाः सभागायां जात्यां जातिमभिनिर्वर्तयन्ति । अतो न संक्रान्तितः । कथं परीत्तहेतुतो विपुलफलाभिनिर्वृत्तितः ? परीत्तं कर्म क्रियते, विपुलः फलविपाकोऽनुभूयते । अतः परीत्तहेतुतो विपुलफलाभिनिर्वृत्तितः ॥ कथं तत्सदृशानुप्रबन्धतः ? यथावेदनीयं कर्म क्रियते, तथावेदनीयो विपाकोऽनुभूयते । अतस्तत्सदृशानुप्रबन्धतश्च ॥ एवमाध्यात्मिकः प्रतीत्यसमुत्पादः पञ्चभिराकारैर्द्रष्टव्यः ॥


यः कश्चिद् भदन्त शारिपुत्र इमं प्रतीत्यसमुत्पादं भगवता सम्यक्प्रणीतमेवं यथाभूतं सम्यक्प्रज्ञया सततसमितमजीवं निर्जीवं यथावदविपरीतमजातमभूतमकृतमसंस्कृतमप्रतिघमनालम्बं शिवमभयमनाहार्यमव्ययमव्युपशमस्वभावं पश्यति, असतः तुच्छतः रिक्ततः असारतः रोगतः गण्डतः शल्यतः अघतः अनित्यतः दुःखतः शून्यतः अनात्मतः समनुपश्यति, न स पूर्वान्तं प्रतिसरति-किं न्वहमभूवमतीतेऽध्वनि, कथं न्वहमभूवमतीतेऽध्वनि इति । अपरान्तं वा न पुनः प्रतिसरति-किं न्वहं भविष्याम्यनागतेऽध्वनि, आहोस्विन्न भविष्याम्यनागतेऽध्वनि, को नु भविष्याम्यनागतेऽध्वनि, कथं नु भविष्याम्यनागतेऽध्वनि इति । प्रत्युत्पन्नं वा पुनर्नं प्रतिसरति-किं न्विदम्, कथं न्विदम्, के सन्तः के भविष्यामः, इमे सत्त्वाः कुत आगताः, इतश्च्युताः कुत्र गमिष्यन्तीति । यानि एकेषां श्रमणब्राह्मणानां पृथग् लोके दृष्टिगतानि भविष्यन्ति, तद्यथा-आत्मवादप्रतिसंयुक्तानि सत्त्ववादप्रतिसंयुक्तानि जीववादप्रतिसंयुक्तानि पुद्गलवादप्रतिसंयुक्तानि कौतुकमङ्गलवादप्रतिसंयुक्तानि उन्मिञ्जितानि निमिञ्जितानि च, तान्यस्य तस्मिन् समये प्रहीणानि भवन्ति परिज्ञातानि समुच्छिन्नमूलानि तालमस्तकवदनाभासगतानि आयत्यामनुत्पादानिरोधधर्माणि ॥

यो भदन्त शारिपुत्र एवंविधधर्मक्षान्तिसमन्वितः प्रतीत्यसमुत्पादं सम्यगवगच्छति, तस्य तथागतोऽर्हन् सम्यक्संबुद्धो विद्याचरणसंपन्नः सुगतो लोकवित् पुरुषदम्यसारथिरनत्तरः शास्ता देवमनुष्याणां बुद्धो भगवान् सम्यक्संबोधिं व्याकरोति-सम्यक्संबुद्धो बुद्धो भविष्यसीति । मैत्रेयेण बोधिसत्त्वेन महासत्त्वेन एवमुक्तम् ॥

अथ खल्वायुष्मान् शारिपुत्रो मैत्रेयस्य बोधिसत्त्वस्य महासत्त्वस्य भाषितमभिनन्द्य अनुप्रमोद्य उत्थायासनात् प्रक्रान्तः । प्रक्रान्तास्ते च भिक्षवः ॥

आर्यशालिस्तम्बं नाम महायानसूत्रं संपूर्णम् ॥
  `,
        'pratitya': `आर्यप्रतीत्यसमुत्पादो नाम महायानसूत्रम् ।

एवं मया श्रुतम् । एकस्मिन् समये भगवान् त्रायस्त्रिंशानां देवानां मध्ये विहरति स्म पाण्डुकम्बलकल्पे शिलातले जिताश्वादिमहाश्रावकैः आर्यमैत्रेयावलोकितेश्वरवज्रहस्तादिभिर्बोधिसत्त्वैर्महासत्त्वैः अप्रमेयगुणरत्नालंकृतैः महाब्रह्मसहांपतिनारायणमहेश्वरादिभिर्देवैः शक्रेण देवानामिन्द्रेण गन्धर्वराजेन पञ्चशिखेन च सार्धम् । अथावलोकितेश्वरो बोधिसत्त्वो महासत्त्वः उत्थायासनात् एकांसमुत्तरासङ्गं कृत्वा दक्षिणं जानुं मेरुपृष्ठेऽवष्टभ्य येन भगनान् तेनाञ्जलिं प्रणम्य भगवन्तमेतदवोचत्-एते हि भगवन् देवाः चैत्यनमस्क्रियामण्डनाः एतत्परिषन्मण्डलपतिताः कथमपि ब्रह्मचर्यपुण्यप्रसवाः सदेवके समारके सब्रह्मके लोके सश्रमणब्राह्मणप्रजासु भिक्षवो भिक्षुण्यः उपासकोपासिकाः सुबहुलपुण्यप्रसवाः भगवतो धर्मदेशनां याचन्ते इति । तदा भगवांस्तेषां प्रतीत्यसमुत्पादगाथामवोचत् -

ये धर्मा हेतुप्रभवा हेतुं तेषां तथागतो ह्यवदत् ।

तेषां च यो निरोध एवं वादी महाश्रमणः ॥

यदिदमवलोकितेश्वर अयं प्रतीत्यसमुत्पादस्तथागतानां धर्मकायः । यः प्रतीत्यसमुत्पादं पश्यति, स तथागतं पश्यति । यश्च अवलोकितेश्वर कुलपुत्रः कुलदुहिता वा श्रद्धासमन्वितः अप्रतिष्ठिते पृथिवीप्रदेशे आमलकमात्रं चैत्यं सूचीमात्रं बोधिवृक्षं बकुलपुष्पमात्रं छत्रं कृत्वा प्रतीत्यसमुत्पादधर्मधातुगाथां पठति, स ब्राह्मं पुण्यं प्रसवति । इतः प्रच्याव्य मरणकालं कृत्वा ब्रह्मलोके उत्पद्यते । ततः प्रच्याव्य कालं कृत्वा शुद्धावासकायिकानां देवानां सभागतायामुत्पद्यते ॥

एवमवोचद्भगवान् । सर्वे च ते श्रावकाः, ते च बोधिसत्त्वा महासत्त्वाः, सर्वावती च सा पर्षत्, सदेवमनुष्यासुरगन्धर्वलोकश्च भगवतो भाषितमभ्यनन्दन् ॥

आर्यप्रतीत्यसमुत्पादो नाम महायानसूत्रम् ॥
  `,
        'saddharma': `सद्धर्मपुण्डरीकसूत्रम्।


॥ नमः सर्वबुद्धबोधिसत्त्वेभ्यः।

नमः सर्वतथागतप्रत्येकबुद्धार्यश्रावकेभ्योऽतीतानागतप्रत्युत्पन्नेभ्यश्च बोधिसत्त्वेभ्यः॥

24 समन्तमुखपरिवर्तः॥

अथ खलु अक्षयमतिर्बोधिसत्त्वो महासत्त्व उत्थायासनादेकांसमुत्तरासङ्गं कृत्वा दक्षिणं जानुमण्डलं पृथिव्यां प्रतिष्ठाप्य येन भगवांस्तेनाञ्जलिं प्रणाम्य भगवन्तमेतदवोचत्-केन कारणेन भगवन् अवलोकितेश्वरो बोधिसत्त्वो महासत्त्वोऽवलोकितेश्वर इत्युच्यते? एवमुक्ते भगवानक्षयमतिं बोधिसत्त्वं महासत्त्वमेतदवोचत्-इह कुलपुत्र यावन्ति सत्त्वकोटीनयुतशतसहस्राणि यानि दुःखानि प्रत्युनुभवन्ति, तानि सचेदवलोकितेश्वरस्य बोधिसत्त्वस्य महासत्त्वस्य नामधेयं शृणुयुः, ते सर्वे तस्माद्दुःखस्कन्धाद् परिमुच्येरन्। ये च कुलपुत्र सत्त्वा अवलोकितेश्वरस्य बोधिसत्त्वस्य महासत्त्वस्य नामधेयं धारयिष्यन्ति, सचेत्ते महत्यग्निस्कन्धे प्रपतेयुः, सर्वे ते अवलोकितेश्वरस्य बोधिसत्त्वस्य महासत्त्वस्य तेजसा तस्मान्महतोऽग्निस्कन्धात् परिमुच्येरन्। सचेत् पुनः कुलपुत्र सत्त्वा नदीभिरुह्यमाना अवलोकितेश्वरस्य बोधिसत्त्वस्य महासत्त्वस्याक्रन्दं कुर्युः, सर्वास्ता नद्यस्तेषां सत्त्वानां गाधं दद्युः। सचेत् पुनः कुलपुत्र सागरमध्ये वहनाभिरूढानां सत्त्वकोटीनयुतशतसहस्राणां हिरण्यसुवर्णमणिमुक्तावज्रवैडूर्यशङ्खशिलाप्रवालाश्मगर्भमुसारगल्वलोहितमुक्तादीनां कृतनिधीनां स पोतस्तेषां कालिकावातेन राक्षसीद्वीपे क्षिप्तः स्यात्, तस्मिंश्च कश्चिदेवैकः सत्त्वः स्यात् योऽवलोकितेश्वरस्य बोधिसत्त्वस्य महासत्त्वस्याक्रन्दं कुर्यात्, सर्वे ते परिमुच्येरंस्तस्माद् राक्षसीद्वीपात्। अनेन खलु पुनः कुलपुत्र कारणेन अवलोकितेश्वरो बोधिसत्त्वो महासत्त्वोऽवलोकितेश्वर इति संज्ञायते॥

सचेत् कुलपुत्र कश्चिदेव वध्योत्सृष्टोऽवलोकितेश्वरस्य बोधिसत्त्वस्य महासत्त्वस्याक्रन्दं कुर्यात्, तानि तेषां वध्यघातकानां शस्त्राणि विकीर्येरन्। सचेत् खलु पुनः कुलपुत्र अयं त्रिसाहस्रमहासाहस्रो लोकधातुर्यक्षराक्षसैः परिपूर्णो भवेत्, तेऽवलोकितेश्वरस्य महासत्त्वस्य नामधेयग्रहणेन दुष्टचित्ता द्रष्टुमप्यशक्ताः स्युः। सचेत्खलु पुनः कुलपुत्र कश्चिदेव सत्त्वो दार्वायस्मयैर्हडिनिगडबन्धनैर्बद्धो भवेत्, अपराध्यनपराधी वा, तस्यावलोकितेश्वरस्य बोधिसत्त्वस्य महासत्त्वस्य नामधेयग्रहणेन क्षिप्रं तानि हडिनिगडबन्धनानि विवरमनुप्रयच्छन्ति। ईदृशः कुलपुत्र अवलोकितेश्वरस्य बोधिसत्त्वस्य महासत्त्वस्य प्रभावः॥

सचेत्कुलपुत्र अयं त्रिसाहस्रमहासाहस्रो लोकधातुर्धूर्तैरमित्रैश्चौरैश्च शस्त्रपाणिभिः परिपूर्णो भवेत्, तस्मिंश्चैकः सार्थवाहो महान्तं सार्थं रत्नाढ्यमनर्ध्यं गृहीत्वा गच्छेत्। ते गच्छन्तस्तांश्चौरान् धूर्तान् शत्रूंश्च शस्त्रहस्तान् पश्येयुः। दृष्ट्वा च पुनर्भीतास्त्रस्ता अशरणमात्मानं संजानीयुः। स च सार्थवाहस्तं सार्थमेवं ब्रूयात्-मा भैष्ट कुलपुत्राः, मा भैष्ट, अभयंददमवलोकितेश्वरं बोधिसत्त्वं महासत्त्वमेकस्वरेण सर्वे समाक्रन्दध्वम्। ततो यूयमस्माच्चौरभयादमित्रभयात् क्षिप्रमेव परिमोक्ष्यध्वे। अथ खलु सर्व एव स सार्थः एकस्वरेण अवलोकितेश्वरमाक्रन्देत्-नमो नमस्तस्मै अभयंददायावलोकितेश्वराय बोधिसत्त्वाय महासत्त्वायेति॥ सहनामग्रहणेनैव स सार्थः सर्वभयेभ्यः परिमुक्तो भवेत्। ईदृशः कुलपुत्र अवलोकितेश्वरस्य बोधिसत्त्वस्य महासत्त्वस्य प्रभावः॥

ये कुलपुत्र रागचरिताः सत्त्वाः, तेऽवलोकितेश्वरस्य बोधिसत्त्वस्य महासत्त्वस्य नमस्कारं कृत्वा विगतरागा भवन्ति। ये द्वेषचरिताः सत्त्वाः, तेऽवलोकितेश्वरस्य बोधिसत्त्वस्य महासत्त्वस्य नमस्कारं कृत्वा विगतद्वेषा भवन्ति। ये मोहचरिताः सत्त्वाः, तेऽवलोकितेश्वरस्य बोधिसत्त्वस्य महासत्त्वस्य नमस्कारं कृत्वा विगतमोहा भवन्ति। एवं महर्द्धिकः कुलपुत्र अवलोकितेश्वरो बोधिसत्त्वो महासत्त्वः॥

यश्च कुलपुत्र अवलोकितेश्वरस्य बोधिसत्त्वस्य महासत्त्वस्य पुत्रकामो मातृग्रामो नमस्कारं करोति, तस्य पुत्रः प्रजायते अभिरूपः प्रासादिको दर्शनीयः। पुत्रलक्षणसमन्वागतो बहुजनप्रियो मनापोऽवरोपितकुशलमूलश्च भवति। यो दारिकामभिनन्दति, तस्य दारिका प्रजायते अभिरूपा प्रासादिका दर्शनीया परमया शुभवर्णपुष्करतया समन्वागता दारिका-लक्षणसमन्वागता बहुजनप्रिया मनापा अवरोपितकुशलभूला च भवति। ईदृशः कुलपुत्र अवलोकितेश्वरस्य बोधिसत्त्वस्य महासत्त्वस्य प्रभावः॥

ये च कुलपुत्र अवलोकितेश्वरस्य बोधिसत्त्वस्य महासत्त्वस्य नमस्कारं करिष्यन्ति, नामधेयं च धारयिष्यन्ति, तेषाममोघफलं भवति। यश्च कुलपुत्र अवलोकितेश्वरस्य बोधिसत्त्वस्य महासत्त्वस्य नमस्कारं करिष्यति, नामधेयं च धारयिष्यति, यश्च द्वाषष्टीनां गङ्गानदीवालिकासमानां बुद्धानां भगवतां नमस्कारं कुर्यात्, नामधेयानि च धारयेत्, यश्च तावतामेव बुद्धानां भगवतां तिष्ठतां ध्रियतां यापयतां चीवरपिण्डपातशयनासनग्लानप्रत्ययभैषज्यपरिष्कारैः पूजां कुर्यात्, तत्किं मन्यसे कुलपुत्र कियन्तं स कुलपुत्रो वा कुलदुहिता वा ततोनिदानं पुण्याभिसंस्कारं प्रसवेत्? एवमुक्ते अक्षयमतिर्बोधिसत्त्वो महासत्त्वो भगवन्तमेतदवोचत्-बहु भगवन्, बहु सुगत स कुलपुत्रो वा कुलदुहिता वा ततोनिदानं बहुं पुण्याभिसंस्कारं प्रसवेत्। भगवानाह-यश्च कुलपुत्र तावतां बुद्धानां भगवतां सत्कारं कृत्वा पुण्याभिसंस्कारः, यश्च अवलोकितेश्वरस्य बोधिसत्त्वस्य महासत्त्वस्य अन्तश एकमपि नमस्कारं कुर्यात् नामधेयं च धारयेत्, समोऽनधिकोऽनतिरेकः पुण्याभिसंस्कारः उभयतो भवेत्। यश्च तेषां द्वाषष्टीनां गङ्गानदीवालिकासमानां बुद्धानां भगवतां सत्कारं कुर्यात् नामधेयानि च धारयेत्, यश्च अवलोकितेश्वरस्य बोधिसत्त्वस्य महासत्त्वस्य नमस्कारं कुर्यात् नामधेयं च धारयेत्, एतावुभौ पुण्यस्कन्धौ न सुकरौ क्षपयितुं कल्पकोटीनयुतशतसहस्रैरपि। एवमप्रमेयं कुलपुत्र अवलोकितेश्वरस्य बोधिसत्त्वस्य महासत्त्वस्य नामधारणात् पुण्यम्॥

अथ खल्वक्षयमतिर्बोधिसत्त्वो महासत्त्वो भगवन्तमेतदवोचत्-कथं भगवन् अवलोकितेश्वरो बोधिसत्त्वो महासत्त्वोऽस्यां सहायां लोकधातौ प्रविचरति? कथं सत्त्वानां धर्मं देशयति? कीदृशश्चावलोकितेश्वरस्य बोधिसत्त्वस्य महासत्त्वस्योपायकौशल्यविषयः? एवमुक्ते भगवानक्षयमतिं बोधिसत्त्वं महासत्त्वमेतदवोचत्-सन्ति कुलपुत्र लोकधातवः येष्ववलोकितेश्वरो बोधिसत्त्वो महासत्त्वो बुद्धरूपेण सत्त्वानां धर्मं देशयति। सन्ति लोकधातवः, येष्ववलोकितेश्वरो बोधिसत्त्वो महासत्त्वो बोधिसत्त्वरूपेण सत्त्वानां धर्मं देशयति। केषांचित् प्रत्येकबुद्धरूपेण अवलोकितेश्वरो बोधिसत्त्वो महासत्त्वः सत्त्वानां धर्मं देशयति। केषांचिच्छ्रावकरूपेण अवलोकितेश्वरो बोधिसत्त्वो महासत्त्वः सत्त्वानां धर्मं देशयति। केषांचिद् ब्रह्मरूपेणावलोकितेश्वरो बोधिसत्त्वो महासत्त्वः सत्त्वानां धर्मं देशयति। केषांचिच्छक्ररूपेणावलोकितेश्वरो बोधिसत्त्वो महासत्त्वः धर्मं देशयति॥ केषांचिद् गन्धर्वरूपेणावलोकितेश्वरो बोधिसत्त्वो महासत्त्वः सत्त्वानां धर्मं देशयति। केषांचिद् गन्धर्वरूपेणावलोकितेश्वरो बोधिसत्त्वो महासत्त्वः सत्त्वानां धर्मं देशयति। यक्षवैनेयानां सत्त्वानां यक्षरूपेण धर्मं देशयति। ईश्वरवैनेयानां सत्त्वानामीश्वररूपेण, महेश्वरवैनेयानां सत्त्वानां महेश्वररूपेण धर्मं देशयति। चक्रवर्तिराजवैनेयानां सत्त्वानां चक्रवर्तिराजरूपेण धर्मं देशयति। पिशाचवैनेयानां सत्त्वानां पिशाचरूपेण धर्मं देशयति। वैश्रवणवैनेयानां सत्त्वानां वैश्रवणरूपेण धर्मं देशयति।

सेनापतिवैनेयानां सत्त्वानां सेनापतिरूपेण धर्मं देशयति। ब्राह्मणवैनेयानां सत्त्वानां ब्राह्मणरूपेण धर्मं देशयति। वज्रपाणिवैनेयानां सत्त्वानां वज्रपाणिरूपेण धर्मं देशयति। एवमचिन्त्यगुणसमन्वागतः कुलपुत्र अवलोकितेश्वरो बोधिसत्त्वो महासत्त्वः। तस्मात्तर्हि कुलपुत्र अवलोकितेश्वरं बोधिसत्त्वं महासत्त्वं पूजयध्वम्। एष कुलपुत्र अवलोकितेश्वरो बोधिसत्त्वो महासत्त्वो भीतानां सत्त्वानामभयं ददाति। अनेन कारणेन अभयंदद इति संज्ञायते इह सहायां लोकधातौ॥

अथ खल्वक्षयमतिर्बोधिसत्त्वो महासत्त्वो भगवन्तमेतदवोचत्-दास्यामो वयं भगवन् अवलोकितेश्वराय बोधिसत्त्वाय महासत्त्वाय धर्मप्राभृतं धर्माच्छादम्। भगवानाहयस्येदानीं कुलपुत्र कालं मन्यसे। अथ खल्वक्षयमतिर्बोधसत्त्वो महासत्त्वः स्वकण्ठादवर्ताय शतसहस्रमूल्यं मुक्ताहारमवलोकितेश्वराय बोधिसत्त्वाय महासत्त्वाय धर्माच्छादमनुप्रयच्छति स्म-प्रतीच्छ सत्पुरुष इमं धर्माच्छादं ममान्तिकात्। स न प्रतीच्छति स्म। अथ खल्वक्षयमतिर्बोधिसत्त्वो महासत्त्वोऽवलोकितेश्वरं बोधिसत्त्वं महासत्त्वमेतदवोचत्-प्रतिगृहाण त्वं कुलपुत्र इमं मुक्ताहारमस्माकमनुकम्पामुपादाय। अथ खल्ववलोकितेश्वरो बोधिसत्त्वो महासत्त्वोऽक्षयमतेर्बोधिसत्त्वस्य महासत्त्वस्यान्तिकात् तं मुक्ताहारं प्रतिगृह्णाति स्म अक्षयमतेर्बोधिसत्त्वस्य महसत्त्वस्यानुकम्पामुपादाय, तासां च चतसृणां पर्षदां तेषां च देवनागयक्षगन्धर्वासुरगरूडकिन्नरमहोरगमनुष्यामनुष्याणामनुकम्पामुपादाय। प्रतिगृह्य च द्वौ प्रत्यंशौ कृतवान्। कृत्वा चैकं प्रत्यंशं भगवते शाक्यमुनये ददाति स्म, द्वितीयं प्रत्यंशं भगवतः प्रभूतरत्नस्य तथागतस्यार्हतः सम्यक्संबुद्धस्य रत्नस्तूपे समुपनामयायास। ईदृश्या कुलपुत्र विकुर्वया अवलोकितेश्वरो बोधिसत्त्वो महासत्त्वोऽस्यां सहायां लोकधातावनुविचरति॥

अथ खलु भगवांस्तस्यां वेलायामिमा गाथा अभाषत—

चित्रध्वज अक्षयोमती
एतमर्थं परिपृच्छि कारणात्॥
केना जिनपुत्र हेतुना
उच्यते हि अवलोकितेश्वरः॥१॥

अथ स दिशता विलोकिया
प्रणिधीसागरु अक्षयोमति।
चित्रध्वजोऽध्यभाषत
शृणु चर्यामवलोकितेश्वरे॥२॥

कल्पशत नेककोट्यचिन्तिया
बहुबुद्धान सहस्रकोटिभिः।
प्रणिधान यथा विशोधितं
स्तथ शृण्वाहि मम प्रदेशतः॥३॥

श्रवणो अथ दर्शनोऽपि च
अनुपूर्वं च तथा अनुस्मृतिः।
भवतीह अमोघ प्राणिनां
सर्वदुःखभवशोकनाशकः॥४॥

सचि अग्निखदाय पातयेद्
घतनार्थाय प्रदुष्टमानसः।
स्मरतो अवलोकितेश्वरं
अभिसिक्तो इव अग्नि शाम्यति॥५॥

सचि सागरदुर्गि पातये-
न्नागमकरसुरभूतआलये।
स्मरतो अवलोकितेश्वरं
जलराजे न कदाचिसीदति॥६॥

सचि मेरुतलातु पातयेद्
घतनार्थाय प्रदुष्टमानसः।
स्मरतो अवलोकितेश्वरं
सूर्यभूतो व नभे प्रतिष्ठति॥७॥

वज्रामय पर्वतो यदि
घतनार्थाय हि मूर्ध्नि ओषरेत्।
स्मरतो अवलोकितेश्वरं
रोमकूप न प्रभोन्ति हिंसितुम्॥८॥

सचि शत्रुगणैः परीवृतः
शस्त्रहस्तैर्विहिंसचेतसैः।
स्मरतो अवलोकितेश्वरं
मैत्रचित्त तद भोन्ति तत्क्षणम्॥९॥

सचि आघतने उपस्थितो
वध्यघातनवशंगतो भवेत्।
स्मरतो अवलोकितेश्वरं
खण्डखण्ड तद शस्त्र गच्छियुः॥१०॥

सचि दारुमयैरयोमयै-
र्हडिनिगडैरिह बद्धबन्धनैः।
स्मरतो अवलोकितेश्वरं
क्षिप्रमेव विपटन्ति बन्धना॥११॥

मन्त्रा बल विद्य ओषधी
भूत वेताल शरीरनाशका।
स्मरतो अवलोकितेश्वरं
तान् गच्छन्ति यतः प्रवर्तिताः॥१२॥

सचि ओजहरैः परीवृतो
नागयक्षसुरभूतराक्षसैः।
स्मरतो अवलोकितेश्वरं
रोमकूप न प्रभोन्ति हिंसितुम्॥१३॥

सचि व्यालमृगैः परीवृत-
स्तीक्ष्णदंष्ट्रनखरैर्महाभयैः।
स्मरतो अवलोकितेश्वरं
क्षिप्र गच्छन्ति दिशा अनन्ततः॥१४॥

सचि दृष्टिविषैः परीवृतो
ज्वलनार्चिशिखिदुष्टदारुणैः।
स्मरतो अवलोकितेश्वरं
क्षिप्रमेव ते भोन्ति निर्विषाः॥१५॥

गम्भीर सविद्यु निश्चरी
मेघवज्राशनि वारिप्रस्रवाः।
स्मरतो अवलोकितेश्वरं
क्षिप्रमेव प्रशमन्ति तत्क्षणम्॥१६॥

बहुदुःखशतैरुपद्रुतान्
सत्त्व दृष्ट्व बहुदुःखपीडितान्।
शुभज्ञानबलो विलोकिया
तेन त्रातरु गजे सदेवके॥१७॥

ऋद्धीबलपारमिंगतो
विपुलज्ञान उपायशिक्षितः।
सर्वत्र दशद्दिशी जगे
सर्वक्षेत्रेषु अशेष दृश्यते॥१८॥

ये च अक्षणदुर्गती भया
नरकतिर्यग्यमस्य शासने।
जातीजरव्याधिपीडिता
अनुपूर्वं प्रशमन्ति प्राणिनाम्॥१९॥

अथ खलु अक्षमतिर्हृष्टतुष्टमना इमा गाथा अभाषत—

शुभलोचन मैत्रलोचना
प्रज्ञाज्ञानविशिष्टलोचना।
कृपलोचन शुद्धलोचना
प्रेमणीय सुमुखा सुलोचना॥२०॥

अमलामलनिर्मलप्रभा
वितिमिर ज्ञानदिवाकरप्रभा।
अपहृतानिलज्वलप्रभा
प्रतपन्तो जगती विरोचसे॥२१॥

कृपसद्गुणमैत्रगर्जिता
शुभगुण मैत्रमना महाघना।
क्लेशाग्नि शमेसि प्राणिनां
धर्मवर्षं अमृतं प्रवर्षसि॥२२॥

कलहे च विवादविग्रहे
नरसंग्रामगते महाभये।
स्मरतो अवलोकितेश्वरं
प्रशमेया अरिसंघ पापका॥२३॥

मेघस्वर दुन्दुभिस्वरो
जलधरगर्जित ब्रह्मसुस्वरः।
स्वरमण्डलपारमिंगतः
स्मरणीयो अवलोकितेश्वरः॥२४॥

स्मरथा स्मरथा स काङ्क्षथा
शुद्धसत्त्वं अवलोकितेश्वरम्।
मरणे व्यसने उपद्रवे
त्राणु भोति शरणं परायणम्॥२५॥

सर्वगुणस्य पारमिंगतः
सर्वसत्त्वकृपमैत्रलोचनो।
गुणभूत महागुणोदधी
वन्दनीयो अवलोकितेश्वरः॥२६॥

योऽसौ अनुकम्पको जगे
बुद्ध भेष्यति अनागतेऽध्वनि।
सर्वदुःखभयशोकनाशकं
प्रणमामी अवलोकितेश्वरम्॥२७॥

लोकेश्वर राजनायको
भिक्षुधर्माकरु लोकपूजितो।
बहुकल्पशतांश्चरित्व च
प्राप्तु बोधि विरजां अनुत्तराम्॥२८॥

स्थित दक्षिणवामतस्तथा
वीजयन्त अमिताभनायकम्।
मायोपमता समाधिना
सर्वक्षेत्रे जिन गत्व पूजिषु॥२९॥

दिशि पश्चिमतः सुखाकरा
लोकधातु विरजा सुखावती।
यत्र एष अमिताभनायकः
संप्रति तिष्ठति सत्त्वसारथिः॥३०॥

न च इस्त्रिण तत्र संभवो
नापि च मैथुनधर्म सर्वशः।
उपपादुक ते जिनोरसाः
पद्मगर्भेषु निषण्ण निर्मलाः॥३१॥

सो चैव अमिताभनायकः
पद्मगर्भे विरजे मनोरमे।
सिंहासनि संनिषण्णको
शालरजो व यथा विराजते॥३२॥

सोऽपि तथा लोकनायको
यस्य नास्ति त्रिभवेस्मि सादृशः।
यन्मे पुण्य स्तवित्व संचितं
क्षिप्र भोमि यथ त्वं नरोत्तम॥३३॥ इति॥

अथ खलु धरणिंधरो बोधिसत्त्वो महासत्त्व उत्थायासनादेकांसमुत्तरासङ्गं कृत्वा दक्षिणं जानुमण्डलं पृथिव्यां प्रतिष्ठाप्य येन भगवांस्तेनाञ्जलिं प्रणाम्य भगवन्तमेतदवोचत्-न ते भगवन् सत्त्वाः अवरकेण कुशलमूलेन समन्वागता भविष्यन्ति, येऽवलोकितेश्वरस्य बोधिसत्त्वस्य महासत्त्वस्येमं धर्मपर्यायपरिवर्तं श्रोष्यन्ति अवलोकितेश्वरस्य बोधिसत्त्वस्य महासत्त्वस्य विकुर्वानिर्देशं समन्तमुखपरिवर्तं नाम अवलोकितेश्वरस्य बोधिसत्त्वस्य विकुर्वणप्रातिहार्यम्॥

अस्मिन् खलु पुनः समन्तमुखपरिवर्ते भगवता निर्देश्यमाने तस्याः पर्षदश्चतुरशीतिनां प्राणिसहस्राणामसमसमायामनुत्तरायां सम्यक्संबोधौ चित्तान्युत्पन्नान्यभूवन्॥

इति श्रीसद्धर्मपुण्डरीके धर्मपर्याये समन्तमुखपरिवर्तो नामावलोकितेश्वर-

विकुर्वणनिर्देशश्चतुर्विशतिमः॥
`,
        'srisukta': `श्रीसूक्त (ऋग्वेद)

ॐ ॥ हिरण्यवर्णां हरिणीं सुवर्णरजतस्रजाम् ।
चन्द्रां हिरण्मयीं लक्ष्मीं जातवेदो म आवह ॥ १॥

तां म आवह जातवेदो लक्ष्मीमनपगामिनीम् ।
यस्यां हिरण्यं विन्देयं गामश्वं पुरुषानहम् ॥ २॥

अश्वपूर्वां रथमध्यां हस्तिनादप्रबोधिनीम् ।
श्रियं देवीमुपह्वये श्रीर्मादेवीर्जुषताम् ॥ ३॥

कां सोस्मितां हिरण्यप्राकारामार्द्रां ज्वलन्तीं तृप्तां तर्पयन्तीम् ।
पद्मे स्थितां पद्मवर्णां तामिहोपह्वये श्रियम् ॥ ४॥

चन्द्रां प्रभासां यशसा ज्वलन्तीं श्रियं लोके देवजुष्टामुदाराम् ।
तां पद्मिनीमीं शरणमहं प्रपद्येऽलक्ष्मीर्मे नश्यतां त्वां वृणे ॥ ५॥

आदित्यवर्णे तपसोऽधिजातो वनस्पतिस्तव वृक्षोऽथ बिल्वः ।
तस्य फलानि तपसा नुदन्तु मायान्तरायाश्च बाह्या अलक्ष्मीः ॥ ६॥

उपैतु मां देवसखः कीर्तिश्च मणिना सह ।
प्रादुर्भूतोऽस्मि राष्ट्रेऽस्मिन् कीर्तिमृद्धिं ददातु मे ॥ ७॥

क्षुत्पिपासामलां ज्येष्ठामलक्ष्मीं नाशयाम्यहम् ।
अभूतिमसमृद्धिं च सर्वां निर्णुद मे गृहात् ॥ ८॥

गंधद्वारां दुराधर्षां नित्यपुष्टां करीषिणीम् ।
ईश्वरीꣳ सर्वभूतानां तामिहोपह्वये श्रियम् ॥ ९॥

मनसः काममाकूतिं वाचः सत्यमशीमहि ।
पशूनां रूपमन्नस्य मयि श्रीः श्रयतां यशः ॥ १०॥

कर्दमेन प्रजाभूता मयि सम्भव कर्दम ।
श्रियं वासय मे कुले मातरं पद्ममालिनीम् ॥ ११॥

आपः सृजन्तु स्निग्धानि चिक्लीत वस मे गृहे ।
नि च देवीं मातरं श्रियं वासय मे कुले ॥ १२॥

आर्द्रां पुष्करिणीं पुष्टिं पिङ्गलां पद्ममालिनीम् ।
चन्द्रां हिरण्मयीं लक्ष्मीं जातवेदो म आवह ॥ १३॥

आर्द्रां यः करिणीं यष्टिं सुवर्णां हेममालिनीम् ।
सूर्यां हिरण्मयीं लक्ष्मीं जातवेदो म आवह ॥ १४॥

तां म आवह जातवेदो लक्ष्मीमनपगामिनीम् ।
यस्यां हिरण्यं प्रभूतं गावो दास्योऽश्वान्विन्देयं पुरुषानहम् ॥ १५॥

यः शुचिः प्रयतो भूत्वा जुहुयादाज्य मन्वहम् ।
श्रियः पञ्चदशर्चं च श्रीकामः सततं जपेत् ॥ १६॥

                  फलश्रुति

पद्मानने पद्म ऊरू पद्माक्षी पद्मसम्भवे ।
त्वं मां भजस्व पद्माक्षी येन सौख्यं लभाम्यहम् ॥

अश्वदायी गोदायी धनदायी महाधने ।
धनं मे जुषतां देवि सर्वकामांश्च देहि मे ॥

पुत्रपौत्र धनं धान्यं हस्त्यश्वादिगवे रथम् ।
प्रजानां भवसि माता आयुष्मन्तं करोतु माम् ॥

धनमग्निर्धनं वायुर्धनं सूर्यो धनं वसुः ।
धनमिन्द्रो बृहस्पतिर्वरुणं धनमश्नु ते ॥

वैनतेय सोमं पिब सोमं पिबतु वृत्रहा ।
सोमं धनस्य सोमिनो मह्यं ददातु सोमिनः ॥

न क्रोधो न च मात्सर्यं न लोभो नाशुभा मतिः ॥

भवन्ति कृतपुण्यानां भक्तानां श्रीसूक्तं जपेत्सदा ॥

वर्षन्तु ते विभावरि दिवो अभ्रस्य विद्युतः ।
रोहन्तु सर्वबीजान्यव ब्रह्म द्विषो जहि ॥

पद्मप्रिये पद्मिनि पद्महस्ते पद्मालये पद्मदलायताक्षि ।
विश्वप्रिये विष्णु मनोऽनुकूले त्वत्पादपद्मं मयि सन्निधत्स्व ॥

या सा पद्मासनस्था विपुलकटितटी पद्मपत्रायताक्षी ।
गम्भीरा वर्तनाभिः स्तनभर नमिता शुभ्र वस्त्रोत्तरीया ।
लक्ष्मीर्दिव्यैर्गजेन्द्रैर्मणिगण खचितैस्स्नापिता हेमकुम्भैः ।
नित्यं सा पद्महस्ता मम वसतु गृहे सर्वमाङ्गल्ययुक्ता ॥

लक्ष्मीं क्षीरसमुद्र राजतनयां श्रीरंगधामेश्वरीम् ।
दासीभूतसमस्त देव वनितां लोकैक दीपांकुराम् ।
श्रीमन्मन्दकटाक्षलब्ध विभव ब्रह्मेन्द्रगङ्गाधरां ।
त्वां त्रैलोक्य कुटुम्बिनीं सरसिजां वन्दे मुकुन्दप्रियाम् ॥

सिद्धलक्ष्मीर्मोक्षलक्ष्मीर्जयलक्ष्मीस्सरस्वती ।
श्रीलक्ष्मीर्वरलक्ष्मीश्च प्रसन्ना मम सर्वदा ॥

वरांकुशौ पाशमभीतिमुद्रां करैर्वहन्तीं कमलासनस्थाम् ।
बालार्क कोटि प्रतिभां त्रिणेत्रां भजेहमाद्यां जगदीश्वरीं ताम् ॥

सर्वमङ्गलमाङ्गल्ये शिवे सर्वार्थ साधिके ।
शरण्ये त्र्यम्बके देवि नारायणि नमोऽस्तु ते ॥

सरसिजनिलये सरोजहस्ते धवलतरांशुक गन्धमाल्यशोभे ।
भगवति हरिवल्लभे मनोज्ञे त्रिभुवनभूतिकरिप्रसीद मह्यम् ॥

विष्णुपत्नीं क्षमां देवीं माधवीं माधवप्रियाम् ।
विष्णोः प्रियसखींम् देवीं नमाम्यच्युतवल्लभाम् ॥

महालक्ष्मी च विद्महे विष्णुपत्नी च धीमही ।
तन्नो लक्ष्मीः प्रचोदयात् ॥

आनन्दः कर्दमः श्रीदश्चिक्लीत इति विश्रुताः ।
ऋषयः श्रियः पुत्राश्च श्रीर्देवीर्देवता मताः ॥

चन्द्रभां लक्ष्मीमीशानाम् सुर्यभां श्रियमीश्वरीम् ।
चन्द्र सूर्यग्नि सर्वाभाम् श्रीमहालक्ष्मीमुपास्महे ॥

श्रीवर्चस्यमायुष्यमारोग्यमाविधात् पवमानं महीयते ।
धनं धान्यं पशुं बहुपुत्रलाभं शतसंवत्सरं दीर्घमायुः ॥

ऋणरोगादिदारिद्र्यपापक्षुदपमृत्यवः ।
भयशोकमनस्तापा नश्यन्तु मम सर्वदा ॥

श्रिये जात श्रिय आनिर्याय श्रियं वयो जनितृभ्यो दधातु ।
श्रियं वसाना अमृतत्वमायन् भजंति सद्यः सविता विदध्यून् ॥

श्रिय एवैनं तच्छ्रियामादधाति । सन्ततमृचा वषट्कृत्यं
सन्धत्तं सन्धीयते प्रजया पशुभिः । य एवं वेद ।

ॐ महादेव्यै च विद्महे विष्णुपत्नी च धीमहि ।
तन्नो लक्ष्मीः प्रचोदयात् ॥

      ॥ ॐ शान्तिः शान्तिः शान्तिः ॥
        `,
        'heart': `प्रज्ञापारमिता हृदय सूत्रम्।

[संक्षिप्तमातृका]

॥ नमः सर्वज्ञाय ॥

॥ ॐ नमो भगवत्यै आर्यप्रज्ञापारमितायै ॥

आर्यावलोकितेश्वरबोधिसत्त्वो गम्भीरायां प्रज्ञापारमितायां चर्यां चरमाणो व्यवलोकयति स्म। पञ्च स्कन्धाः, तांश्च स्वभावशून्यान् पश्यति स्म॥

इह शारिपुत्र रूपं शून्यता, शून्यतैव रूपम्। रूपान्न पृथक् शून्यता, शून्यताया न पृथग् रूपम्। यद्रूपं सा शून्यता, या शून्यता तद्रूपम्॥

एवमेव वेदनासंज्ञासंस्कारविज्ञानानि॥

इहं शारिपुत्र सर्वधर्माः शून्यतालक्षणा अनुत्पन्ना अनिरुद्धा अमला न विमला नोना न परिपूर्णाः। तस्माच्छारिपुत्र शून्यतायां न रूपम्, न वेदना, न संज्ञा, न संस्काराः, न विज्ञानानि। न चक्षुःश्रोत्रघ्राणजिह्वाकायमनांसि, न रूपशब्दगन्धरसस्प्रष्टव्यधर्माः। न चक्षुर्धातुर्यावन्न मनोधातुः॥

न विद्या नाविद्या न विद्याक्षयो नाविद्याक्षयो यावन्न जरामरणं न जरामरणक्षयो न दुःखसमुदयनिरोधमार्गा न ज्ञानं न प्राप्तित्वम्॥

बोधिसत्त्वस्य प्रज्ञापारमितामाश्रित्य विहरति चित्तावरणः। चित्तावरणनास्तित्वादत्रस्तो विपर्यासातिक्रान्तो निष्ठनिर्वाणः। त्र्यध्वव्यवस्थिताः सर्वबुद्धाः प्रज्ञापारमितामाश्रित्य अनुत्तरां सम्यक्संबोधिमभिसंबुद्धाः॥

तस्माज्ज्ञातव्यः प्रज्ञापारमितामहामन्त्रो महाविद्यामन्त्रोऽनुत्तरमन्त्रोऽसमसममन्त्रः सर्वदुःखप्रशमनः सत्यममिथ्यत्वात् प्रज्ञापारमितायामुक्तो मन्त्रः।

तद्यथा- गते गते पारगते पारसंगते बोधि स्वाहा॥

इति प्रज्ञापारमिताहृदयसूत्रं समाप्तम्॥
`,
        'nilakantha': `नीलकण्ठ धारणी

नमो रत्नत्रयाय । नम आर्यावलोकितेश्वराय बोधिसत्त्वाय महासत्त्वाय महाकारुणिकाय सर्वबन्धनच्छेदनकराय सर्वभवसमुद्रशोषणकराय सर्वव्याधिप्रशमनकराय सर्वेत्युपद्रवविनाशनकराय सर्वभयेषु त्राणकराय ।

तस्मै नमस्कृत्वा इमं आर्यावलोकितेश्वरभाषितं नीलकण्ठनाम ।

हृदयं वर्तयिष्यामि सर्वार्थसाधकं शुभम् ।
अजेयं सर्वभूतानां भवमार्गविशोधकम् ॥

तद्यथा । ॐ आलोक ए आलोकमति लोकातिक्रान्त एहि हरे आर्यावलोकितेश्वर महाबोधिसत्त्व । हे बोधिसत्त्व हे महाबोधिसत्त्व हे वीर्यबोधिसत्त्व हे महाकारुणिक स्मर हृदयम् । एह्येहि हरे आर्यावलोकितेश्वर महेश्वर परमार्थचित्त महाकारुणिक । कुरुकुरु कर्म । साधयसाधय विद्याम् । देहिदेहि त्वरं कामम् गम विहङ्गम विगम सिद्धयोगेश्वर । धुरुधुरु वियन्त ए महावियन्त ए । धरधर धरेन्द्रेश्वर । चलचल विमलामल आर्यावलोकितेश्वर जिन । कृष्णजटामकुटाऽवरम प्ररम विरम महासिद्धविद्याधर । बलबल महाबल मल्लमल्ल महामल्ल चल चल महाचल । कृष्णवर्ण दीर्घकृष्णपक्षनिर्घातन हे पद्महस्त । चर चर निशाचरेश्वर कृष्णसर्पकृतयज्ञोपवीत । एह्येहि महावराहमुख त्रिपुरदहनेश्वर नारायणबलोपबलवेशधर । हे नीलकण्ठ हे महाकाल हलाहलविष निर्जित लोकस्य रागविष विनाशन द्वेषविषविनाशन मोहविषविनाशन हुलुहुलु मल्ल । हुलु हरे महापद्मनाभ । सरसर सिरिसिरि सुरुसुरु मुरुमुरु बुध्यबुध्य बोधयबोधय मैत्रिय नीलकण्ठ । एह्येहि वामस्थितसिंहमुख । हसहस मुञ्चमुञ्च महाट्टहासम् । एह्येहि भो महासिद्धयोगेश्वर । भणभण वाचम् । साधयसाधय विद्याम् । स्मरस्मर तं भगवन्तं लोकितविलोकितं लोकेश्वरं तथागतम् । ददाहि मे दर्शनकामस्य दर्शनम् ।

प्रह्लादय मनः स्वाहा ।
सिद्धाय स्वाहा ।
महासिद्धाय स्वाहा ।
सिद्धयोगेश्वराय स्वाहा ।
नीलकण्ठाय स्वाहा ।
वराहमुखाय स्वाहा ।
महानरसिंहमुखाय स्वाहा ।
सिद्धविद्याधराय स्वाहा ।
पद्महस्ताय स्वाहा ।
कृष्णसर्पकृतयज्ञोपवीताय स्वाहा ।
महालकुटधराय स्वाहा ।
चक्रायुधाय स्वाहा ।
शङ्खशब्दनिबोधनाय स्वाहा ।
वामस्कन्धदेशस्थितकृष्णाजिनाय स्वाहा ।
व्याघ्रचर्मनिवसनाय स्वाहा ।
लोकेश्वराय स्वाहा ।
सर्वसिद्धेश्वराय स्वाहा ।

नमो भगवते आर्यावलोकितेश्वराय बोधिसत्त्वाय महासत्त्वाय महाकारुणिकाय ।

`,
        'adibuddha': `आदिबुद्ध द्वादशक स्तोत्रम्

ॐ नम आदिबुद्धाय

नमस्ते बुद्धरूपाय धर्मरूपाय ते नमः|
नमस्ते संघरूपाय पञ्चबुद्धात्मने नमः|| १||

पृथ्वीरूपायाब्रूपाय तेजोरूपाय ते नमः|
नमस्ते वायुरूपायाकाशरूपाय ते नमः|| २||

ब्रह्मणे सत्त्वरूपाय रजोरूपाय विष्णवे|
तमोरूपमहेशाय ज्ञानरूपाय ते नमः|| ३||

प्रज्ञोपायात्मरूपाय गुह्यरूपाय ते नमः|
दिग्रूपलोकपालाय विश्वरूपाय ते नमः|| ४||

चक्षूरूपाय कर्णाय घ्राणरूपाय जिह्वके|
कायरूपाय श्रीधर्मरूपाय मनसे नमः|| ५||

नमस्ते रूपरूपाय रसरूपाय ते नमः|
गन्धरूप-शब्दरूप-स्पर्शरूपाय ते नमः|| ६||

धर्मरूपधारकाय षडिन्द्रियात्मने नमः|
मांसास्थिमेदमज्जानां संघातरूपिणे नमः|| ७||

रूपाय जङ्गमानां ते स्थावराणां च मुर्तये|
तिरश्चां मोहरूपाय रूपायाश्चर्यमूर्तये|| ८||

सृष्टिकर्त्रे जन्मरूप कालरूपाय मृत्यवे|
भव्याय वृद्धरूपाय बालाय ते नमो नमः|| ९||

प्राणापानसमानोदानव्यानमूर्तये नमः|
वर्णापवर्णरूपाय भोक्त्रे तन्मूर्तये नमः|| १०||

दिनरूपाय सूर्याय चन्द्राय रात्रिरूपिणे|
तिथिरूपाय नक्षत्रयोगवारादिमुर्तये|| ११||

बाह्याभ्यन्तररूपाय लौकिकाय नमोनमः|
नैर्वाणाय नमस्तुभ्यं बहुरूपाय ते नमः|| १२||

आदिबुद्धद्वादशकं पुण्यं प्रातः पठिष्यति|
यदिच्छति लभेन्नूनं मनुजो नित्यनिश्चयः|| १३||

श्रीमञ्जुश्रीकृतमादिबुद्धद्वादशकस्तोत्रं समाप्तम्|`,
        'lalitavistara': `ललितविस्तरः

नमः सर्वबुद्धबोधिसत्त्वेभ्यः।

॥ ॐ नमो दशदिगनन्तापर्यन्तलोकधातुप्रतिष्ठितसर्वबुद्धबोधिसत्त्वार्यश्रावकप्रत्येकबुद्धेभ्योऽतीतानागतप्रत्युत्पन्नेभ्यः॥

१० लिपिशालासंदर्शनपरिवर्तो दशमः।

इति हि भिक्षवः संवृद्धः कुमारः। तदा माङ्गल्यशतसहस्रैः लिपिशालामुपनीयते स्म दशभिर्दारकसहस्रैः परिवृतः पुरस्कृतः, दशभिश्च रथसहस्रैः खादनीयभोजनीयस्वादनीयपरिपूर्णैर्हिरण्यसुवर्णपरिपूर्णैश्च। येन कपिलवस्तुनि महानगरे वीथिचत्वररथ्यान्तरापणमुखेष्वभ्यवकीर्यते स्म अभिविश्राम्यन्ते। अष्टाभिश्च तूर्यशतसहस्रैः प्रघुष्यमाणैर्महता च पुष्पवर्षेणाभिप्रवर्षता वितर्दिनिर्यूहतोरणगवाक्षहर्म्यकूटागारप्रासादतलेषु कन्याशतसहस्राणि सर्वालंकारभूषिताः स्थिता अभूवन्। बोधिसत्त्वं प्रेक्षमाणाः कुसुमानि च क्षिपन्ति स्म। अष्टौ च मरुत्कन्यासहस्राणि विगलितालंकाराभरणालंकृतानि रत्नभद्रंकरेण गृहीतानि मार्गं शोधयन्त्यो बोधिसत्त्वस्य पुरतो गच्छन्ति स्म। देवनागयक्षगन्धर्वासुरगरुडकिन्नरमहोरगाश्चार्धकायिका गगनतलात्पुष्पपट्टदामान्यभिप्रलम्बयन्ति स्म। सर्वे च शाक्यगणाः शुद्धोदनं राजानं पुरस्कृत्य बोधिसत्त्वस्य पुरतो गच्छन्ति स्म। अनेनैवंरूपेण व्यूहेन बोधिसत्त्वो लिपिशालामुपनीयते स्म॥

समनन्तरप्रवेशितश्च बोधिसत्त्वो लिपिशालाम्। अथ विश्वामित्रो नाम दारकाचार्यो बोधिसत्त्वस्य श्रियं तेजश्चासहमानो धरणितले निविष्टोऽधोमुखः प्रपतति स्म। तं तथा प्रपतितं दृष्ट्वा शुभाङ्गो नाम तुषितकायिको देवपुत्रो दक्षिणेन करतलेन परिगृह्योत्थापयति स्म। उत्थाप्य च गगनतलस्थो राजानं शुद्धोदनं तं च महान्तं जनकायं गाथाभिरभ्यभाषत्—

शास्त्राणि यानि प्रचलन्ति मनुष्यलोके
संख्या लिपिश्च गणनापि च धातुतन्त्रम्।
ये शिल्पयोग पृथु लौकिक अप्रमेयाः
तेष्वेषु शिक्षितु पुरा बहुकल्पकोट्यः॥१॥

किं तू जनस्य अनुवर्तनतां करोति
लिपिशालमागतु सुशिक्षितु शिष्यणार्थम्।
परिपाचनार्थ बहुदारक अग्रयाने
अन्यांश्च सत्त्वनयुतानमृते विनेतुम्॥२॥

लोकोत्तरेषु चतुसत्यपथे विधिज्ञो
हेतुप्रतीत्यकुशलो यथ संभवन्ति।
यथ चानिरोधक्षयु संस्थितु शीतिभावः
तस्मिन्विधिज्ञ किमथो लिपिशास्त्रमात्रे॥३॥

नेतस्य आचरिय उत्तरि वा त्रिलोके
सर्वेषु देवमनुजेष्वयमेव जेष्ठः।
नामापि तेष लिपिनां न हि वित्थ यूयं
यत्रेषु शिक्षितु पुरा बहुकल्पकोट्यः॥४॥

सो चित्तधार जगतां विविधा विचित्रा
एकक्षणेन अयु जानति शुद्धसत्त्वः।
अदृश्यरूपरहितस्य गतिं च वेत्ति
किं वा पुनोऽथ लिपिनोऽक्षरदृश्यरूपाम्॥५॥

इत्युक्त्वा स देवपुत्रो बोधिसत्त्वं दिव्यैः कुसुमैरभ्यर्च्य तत्रैवान्तर्दधे। तत्र धात्र्यश्च चेटीवर्गाश्च स्थापिता अभूवन्। परिशेषाः शाक्याः शुद्धोदनप्रमुखाः प्रक्रामन्तः॥

अथ बोधिसत्त्व उरगसारचन्दनमयं लिपिफलकमादाय दिव्यार्षसुवर्णतिरकं समन्तान्मणिरत्नप्रत्युप्तं विश्वामित्रमाचार्यमेवमाह-कतमां मे भो उपाध्याय लिपिं शिक्षापयसि। ब्राह्मीखरोष्टीपुष्करसारिं अङ्गलिपिं वङ्गलिपिं मगधलिपिं मङ्गल्यलिपिं अङ्गुलीयलिपिं शकारिलिपिं ब्रह्मवलिलिपिं पारुष्यलिपिं द्राविडलिपिं किरातलिपिं दाक्षिण्यलिपिं उग्रलिपिं संख्यालिपिं अनुलोमलिपिं अवमूर्धलिपिं दरदलिपिं खाष्यलिपिं चीनलिपिं लूनलिपिं हूणलिपिं मध्याक्षरविस्तरलिपिं पुष्पलिपिं देवलिपिं नागलिपिं यक्षलिपिं गन्धर्वलिपिं किन्नरलिपिं महोरगलिपिं असुरलिपिं गरुडलिपिं मृगचक्रलिपिं वायसरुतलिपिं भौमदेवलिपिं अन्तरीक्षदेवलिपिं उत्तरकुरुद्वीपलिपिं अपरगोडानीलिपिं पूर्वविदेहलिपिं उत्क्षेपलिपिं निक्षेपलिपिं विक्षेपलिपिं प्रक्षेपलिपिं सागरलिपिं वज्रलिपिं लेखप्रतिलेखलिपिं अनुद्रुतलिपिं शास्त्रावर्तां गणनावर्तलिपिं उत्क्षेपावर्तलिपिं निक्षेपावर्तलिपिं पादलिखितलिपिं द्विरुत्तरपदसंधिलिपिं यावद्दशोत्तरपदसंधिलिपिं मध्याहारिणीलिपिं सर्वरुतसंग्रहणीलिपिं विद्यानुलोमाविमिश्रितलिपिं ऋषितपस्तप्तां रोचमानां धरणीप्रेक्षिणीलिपिं गगनप्रेक्षिणीलिपिं सर्वौषधिनिष्यन्दां सर्वसारसंग्रहणीं सर्वभूतरुतग्रहणीम्। आसां भो उपाध्याय चतुष्षष्टीलिपीनां कतमां त्वं शिष्यापयिष्यसि?

अथ विश्वामित्रो दारकाचार्यो विस्मितः प्रहसितवदनो निहतमानमददर्प इमां गाथामभाषत—

आश्चर्यं शुद्धसत्त्वस्य लोके लोकानुवर्तिनो।
शिक्षितः सर्वशास्त्रेषु लिपिशालामुपागतः॥६॥

येषामहं नामधेयं लिपीनां न प्रजानमि।
तत्रैष शिक्षितः सन्तो लिपिशालामुपागतः॥७॥

वक्त्रं चास्य न पश्यामि मूर्धानं तस्य नैव च।
शिष्ययिष्ये कथं ह्येनं लिपिप्रज्ञाय पारगम्॥८॥

देवदेवो ह्यतिदेवः सर्वदेवोत्तमो विभुः।
असमश्च विशिष्टश्च लोकेष्वप्रतिपुद्गलः॥९॥

अस्यैव त्वनुभावेन प्रज्ञोपाये विशेषतः।
शिक्षितं शिष्ययिष्यामि सर्वलोकपरायणम्॥१०॥

इति हि भिक्षवो दश दारकसहस्राणि बोधिसत्त्वेन सार्धं लिपिं शिष्यन्ते स्म। तत्र बोधिसत्त्वाधिस्थानेन तेषां दारकाणां मातृकां वाचयतां यदा अकारं परिकीर्तयन्ति स्म, तदा अनित्यः सर्वसंस्कारशब्दो निश्चरति स्म। आकारे परिकीर्त्यमाने आत्मपरहितशब्दो निश्चरति स्म। इकारे इन्द्रियवैकल्यशब्दः। ईकारे ईतिबहुलं जगदिति। उकारे उपद्रवबहुलं जगदिति। ऊकारे ऊनसत्त्वं जगदिति। एकारे एषणासमुत्थानदोषशब्दः। ऐकारे ऐर्यापथः श्रेयानिति। ओकारे ओघोत्तरशब्दः। औकारे औपपादुकशब्दः। अंकारे अमोघोत्पत्तिशब्दः। अःकारे अस्तंगमनशब्दो निश्चरति स्म। ककारे कर्मविपाकावतारशब्दः। खकारे खसमसर्वधर्मशब्दः। गकारे गम्भीरधर्मप्रतीत्यसमुत्पादावतारशब्दः। घकारे घनपटलाविद्यामोहान्धकारविधमनशब्दः। ङकारेऽङ्गविशुद्धिशब्दः। चकारे चतुरार्यसत्यशब्दः। छकारे छन्दरागप्रहाणशब्दः। जकारे जरामरणसमतिक्रमणशब्दः। झकारे झषध्वजबलनिग्रहणशब्दः। ञकारे ज्ञापनशब्दः। टकारे पटोपच्छेदनशब्दः। ठकारे ठपनीयप्रश्नशब्दः। डकारे डमरमारनिग्रहणशब्दः। ढकारे मीढविषया इति। णकारे रेणुक्लेशा इति। तकारे तथतासंभेदशब्दः। थकारे थामबलवेगवैशारद्यशब्दः। दकारे दानदमसंयमसौरभ्यशब्दः। धकारे धनमार्याणां सप्तविधमिति। नकारे नामरूपपरिज्ञाशब्दः। पकारे परमार्थशब्दः। फकारे फलप्राप्तिसाक्षात्क्रियाशब्दः। बकारे बन्धनमोक्षशब्दः। भकारे भवविभवशब्दः। मकारे मदमानोपशमनशब्दः। यकारे यथावद्धर्मप्रतिवेधशब्दः। रकारे रत्यरतिपरमार्थरतिशब्दः। लकारे लताछेदनशब्दः। वकारे वरयानशब्दः। शकारे शमथविपश्यनाशब्दः। षकारे षडायतननिग्रहणाभिज्ञज्ञानावाप्तिशब्दः। सकारे सर्वज्ञज्ञानाभिसंबोधनशब्दः। हकारे हतक्लेशविरागशब्दः। क्षकारे परिकीर्त्यमाने क्षणपर्यन्ताभिलाप्यसर्वधर्मशब्दो निश्चरति स्म॥

इति हि भिक्षवस्तेषां दारकाणां मातृकां वाचयतां बोधिसत्त्वानुभावेनैव प्रमुखान्यसंख्येयानि धर्ममुखशतसहस्राणि निश्चरन्ति स्म॥

तदानुपूर्वेण बोधिसत्त्वेन लिपिशालास्थितेन द्वात्रिंशद्दारकसहस्राणि परिपाचितान्यभूवन्। अनुत्तरायां सम्यक्संबोधौ चित्तान्युत्पादितानि द्वात्रिंशद्दारिकासहस्राणि। अयं हेतुरयं प्रत्ययो यच्छिक्षितोऽपि बोधिसत्त्वो लिपिशालामुपागच्छति स्म॥

॥ इति श्रीललितविस्तरे लिपिशालासंदर्शनपरिवर्तो नाम दशमोऽध्यायः॥
`
      }
    }
  }
}
</script>
